Repository: Claire-Eleutheriane/educational_book
Catalog: ModelicaBook/text/locale/*/LC_MESSAGES/behavior/equations/annotations.po
Languages: es

source: Annotations
es: Anotaciones

source: Recall in the discussion on :ref:`experimental-conditions` we included information about the simulation start and stop time using an ``annotation``. An ``annotation`` is a way to include information that is not related to the behavior of the model. In the case of experimental conditions, we injected information about how a particular model should be simulated. But annotations are used extensively in Modelica to provide all kinds of additional information about models. For example, as we'll see :ref:`later in the book <graphical-annos>`, annotations are used to describe the graphical appearance of components and connectors. For now, the important thing is to understand that annotations are additional data, above and beyond behavior, that can be "attached" to different elements in Modelica.
es: Recordad que en la discusión sobre :ref:`experimental-conditions` incluimos información sobre el tiempo de inicio y fin de la simulación usando una ``anotacion``. Una ``anotacion`` es una manera de incluir información que no está relacionada con el comportamiento del modelo. En el caso de las condiciones experimentales, inyectamos información sobre cómo debe simularse un determinado modelo. Pero las anotaciones se usan de forma extensiva en Modelica para proporcionar todo tipo de información adicional sobre los modelos. Por ejemplo, como veremos :ref:`más adelante en el libro <graphical-annos>`, las anotaciones se usan para describir la apariencia gráfica de los componentes y conectores. Por ahora, lo importante es entender que las anotaciones son datos adicionales, por encima y más allá del comportamiento, que pueden ser "agregadas" a diferentes elementos en Modelica.

source: In this section, we will first cover where an ``annotation`` can appear in a Modelica model. Next, we'll explain how we can use :ref:`record-def` to describe the contents of an annotation. Finally, we'll describe a few of the many "standard" annotations that are included as part of the Modelica specification.
es: En esta sección, veremos primero dónde puede aparecer una ``annotation`` en un modelo de Modelica. Despues explicaremos cómo podemos usar :ref:`record-def` para describir el contenido de una anotación. Finalmente describiremos algunas de las muchas anotaciones "estándar" que están incluidas como parte de la especificación de Modelica.

source: Annotation Locations
es: Ubicación de las anotaciones

source: Annotations can appear in many different places in Modelica. We will discuss each potential location and demonstrate the syntax for each case.
es: Las anotaciones pueden aparecer en muchos sitios en Modelica. Discutiremos cada ubicación potencial y mostraremos la sintaxis para cada caso.

source: Declaration Annotations
es: Declaración de anotaciones

source: A declaration annotation comes at the end of a declaration, right before the ``;``. Here is a simple declaration that includes an annotation:
es: La declaración de anotaciones va al final de una declaración, justo antes del ``;``. Ésta es una declaración simple que incluye una anotación:

source: Note that the ``annotation`` comes after the descriptive string and before the ``;``. Also, the ``...`` is simply a place holder for the :ref:`annotation-data`, which will be discussed shortly.
es: Observad que la ``anotación`` va después de la cadena de caracteres descriptiva y antes de ``;``. También, el ``...`` es simplemente un marcador de posición para la :ref:`annotation-data`, que se tratará en breve.

source: Statement and Equation Annotations
es: Declaración y anotaciones de ecuaciones

source: It is also possible to associate annotations with equations, for example:
es: También es posible asociar anotaciones con ecuaciones, por ejemplo:

source: Inheritance Annotations
es: Herencia de anotaciones

source: We briefly discussed the ``extends`` keyword when we talked about :ref:`modifications` and :ref:`avoiding-repetition`. It is possible to associate an ``annotation`` with an ``extends`` clause as follows:
es: Tratamos brevemente la palabra clave ``extends`` cuando hablamos sobre :ref:`modifications` y :ref:`avoiding-repetition`. Es posible asociar una ``anotación`` con una sentencia ``extends`` como sigue:

source: As we've observed in each previous case, the ``annotation`` immediately precedes the ``;``.
es: Como hemos observado en cada caso previo, la ``anotación`` precede inmediatamente el ``;``.

source: Model Annotations
es: Anotaciones de modelo

source: A model annotation associates annotation data directly with the model definition itself. This is exactly the kind of annotation we saw when describing :ref:`experimental-conditions`, *e.g.,*
es: Una anotación de modelo asocia los datos de la anotación directamente con la definición del propio modelo. Es exactamente el tipo de anotación que vimos cuando describimos :ref:`experimental-conditions`, *por ejemplo,*

source: Note how, unlike all the previous annotation locations we've described, this annotation isn't really "attached" to anything. This indicates that it is annotating the model itself.
es: Obsérvese cómo a diferencia de todas las ubicaciones de anotaciones que hemos descrito previamente, estaanotación no esta realmente "unida" a nada. Esto indica que está anotada al modelo en si mismo.

source: Annotation Data
es: Datos de la anotación

source: General Syntax
es: Sintaxis general

source: The syntax of an annotation is the same syntax used for :ref:`modifications`. This means the annotation will include either an assignment to a variable in the annotation, *e.g.,*
es: La sintaxis de una anotación es la misma sintaxis usada para las :ref:`modifications`. Esto significa que la anotación incluirá o una asignación a una variable en la anotación, *por ejemplo,*

source: or it will include a modification to something **inside** a variable in the annotation, *e.g.,*
es: o incluirá una modificación de algo **dento** de una variable en la anotación, *por ejemplo,*

source: User Annotations
es: Anotaciones de usuario

source: Annotations were designed to allow model developers to attach **arbitrary data** to their models. For example, if a user wanted to associate a part number with a given model definition, they might introduce a model annotation like this:
es: Las anotaciones fueron diseñadas para permitir a los desarrolladores de modelos adjuntar **información arbitraria** a sus modelos. Por ejemplo, si un usuario quiere asociar un número de pieza con la definición de un determinado modelo, pueden introducir una anotación de modelo como esta:

source: A general principle of annotation data is that if a tool reads in a model, **it must preserve the annotation information** when it writes it back out. The tool does not (and, in general, will not) have to understand the data. But the data must be preserved.
es: Un principio general de los datos de las anotaciones es que si una herramienta lee en un modelo, **debe mantener la información de la anotación** cuando lo escribe de nuevo. La herramienta no tiene que entender los datos (y en general no lo hará). Pero los datos deben mantenerse.

source: Multiple Annotations
es: Anotaciones múltiples

source: Imagine a user wanted to specify **both** a part number and an experiment annotation. Then they might end up with an annotation like this one:
es: Imaginemos que un usuario quiere especifica **tanto** un número de pieza como una anotación de experimento. Entonces acabaría con una anotación como esta:

source: Note how these two pieces of information can exist side by side. One way to think about annotations is to visualize them as a tree like this:
es: Observad cómo estas dos partes de información pueden existir juntas. Una manera depensar sobre las anotaciones es visualizarlas como un arbol como este:

source: Namespaces
es: Espacio de nombres

source: This introduces another principle of annotations which is that it should be possible to have more than one **as long as the names are different**. For this reason, choosing names is very important and they should be chosen to avoid potential conflicts with other names. For example, a better approach for including the part number would be to enclose it in a variable that is more likely to be unique to your company or application, *e.g.,*:
es: Esto introduce otro principio de las anotaciones que es que debe ser posible tener más de una **siempre y cuando los nombres sean diferentes**. Por esta razon, escoger nombres es muy importante y deben escogerse para evitar conflictos potenciales con otros nombres. Por ejemplo, una aproximación mejor para incluir el número de pieza sería incluirla en una variable que tenga más posibilidades de ser única en vuestra compañía o aplicación, *por ejemplo,*:

source: In this case, the variable ``XogenyIndustries`` can be used to carve out a "namespace" for a specific organization or purpose. If another organization came along and wanted to associate a different part number with the same model, they could do that by establishing their own separate hierarchy in the annotation, *e.g.,*:
es: En este caso, la variable ``XogenyIndustries`` puede usarse para labrarse un "espacio de nombres" para una organización o proposito específico. Si otra organización llega y quiere asociar un número de pieza diferente con el mismo modelo, pueden hacerlo estableciendo su propia jerarquía separada en la anotación, *por ejemplo,*

source: Occasionally, Modelica tool vendors include their own special annotations (*e.g.,* in the Modelica Standard Library). By convention, tool vendors use names that are prefixed by two underscores, *e.g.,*
es: Ocasionalmente, los vendedores de herramientas Modelica incluyen sus propias anotaciones especiales (*por ejemplo,* en la Modelica Standard Library). Por convención, los vendedores de herramientas usan nombre que tienen dos barras bajas como prefijo, *por ejemplo,*

source: Intepretation
es: Interpretación

source: Remember that annotation data is arbitrary. This allows arbitrary data to be associated with the model. The **meaning** of that data is, in general, not defined in the Modelica specification. As we will see shortly, there are a few "standard" annotations (they will be described throughout this book) and they are documented in the specification. But when users add annotations beyond the standard annotations it is assumed that they have some way (using some Modelica tool, compiler or other Modelica aware technology) of extracting and interpreting their annotation data.
es: Recordad que los datos de una anotación son arbitrarios. Esto permite asociar datos arbitrarios con el modelo. El **significado** de estos datos no esta, en general, definido en la especificación de Modelica. Como veremos en breve, hay unas pocas anotaciones "estándar" (se describirán a lo largo de este libro) que están documentadas en la especificación. Pero cuando los usuarios añaden anotaciones bajo el estándar se asume que disponen de alguna manera (usando alguna herramienta Modelica, compilador o otra tecnología Modelica) de extraer e interpretar la información de la anotación.

source: The bottom line is that while you can inject (non-standard) annotation data into the model, tools are only required to preserve it and not to interpret it.
es: El resultado final es que mientras podemos inyectar anotaciones (no estándar) en el modelo, las herramientas solamente están obligadas a mantenerlas pero no a interpretarlas.

source: Documentation
es: Documentación

source: It is very common to document Modelica annotations **as if** they had :ref:`record-def` associated with them. We'll see several examples of this technique in our next topic. Using this approach to document expected annotation data are strongly encouraged. In fact, this technique is so popular and useful that there are proposals to actually make it part of the language itself in the future.
es: Es muy común documentar las anotaciones de Modelica **como si** tuvieran :ref:`record-def` asociadas a ellas. Veremos múltiples ejemplos de esta tecnica en nuestro siguiente tema. Se recomienda intensamente usar esta aproximación para documentar la información esperada de las anotaciones. De hecho, esta técnica es tan popular y útil que hay propuestas para que formen parte realmente del propio lenguaje en el futuro.

source: Introductory Annotations
es: Anotaciones introductorias

source: This section introduces just a few of the "standard annotations" in Modelica. As discussed previously, annotations are generally allowed to include arbitrary data that is preserved by tools and, presumably, interpreted at some point. The syntax and meaning of the standard annotations are described in the Modelica specification so they can be interpreted consistently and universally by Modelica tools.
es: Esta sección presenta solamente unas pocas "anotaciones estándar" en Modelica. Como se ha tratado previamente, generalemente se permite que las anotaciones incluyan información arbitraria que es conservada por las herramientas y, presumiblemente, interpretada en algún momento. La sintaxis y significado de las anotaciones estándar se describen en la especificación de Modelica de manera que puedan ser interpretadas de forma consistente y universal por las herramientas Modelica.

source: We will follow a convention (whenever possible) of describing standard annotations in terms of ``record`` definitions. These ``record`` definitions don't formally exist, they are simply a concise way of expressing the data contained in the annotation.
es: Seguiremos la convención (cuando sea posible) de describir las anotaciones estándar en término de definiciones ``record``. Estas definiciones ``record`` no existen formalmente, simplemente son una manera concisa de expresar la información contenida en la anotación.

source: ``Documentation``
es: ``Documentación``

source: The ``Documentation`` annotation in Modelica allows raw text or HTML to be associated with a model as documentation. This documentation is composed of two components. The first is information about the model and the second is revision history information. The structure of the ``Documentation`` annotation is described by the following record definition:
es: La anotación tipo ``documentación`` en Modelica permite asociar a un modelo texto plano o HTML como documentación. Esta documentación está compuesta de dos componentes. El primero es información sobre el modelo y el segundo es información sobre la historia de versiones. La estructura de la anotación ``documentación`` se describe en la siguiente definición de record:

source: When embedding HTML inside an annotation, the HTML code must be surrounded by ``<html>`` tags, *e.g.,*
es: Cuando se incrusta HTML en una anotación, el código HTML debe estar rodeado por etiquetas ``<html>``, *por ejemplo,*

source: Here the model ``MyWidget`` contains HTML documentation. The documentation is wrapped by ``<html>`` tags **and all quotes used to define attributes are escaped by \\"** to avoid accidentally terminating the ``info`` string.
es: Aquí el modelo ``MyWidget`` contiene documentación HTML. La documentación esta envuelto en etiquetas ``<html>`` **y todas las citas usadas para definir atributos están

source: ``experiment``
es: ``experimento``

source: The ``experiment`` annotation is used to specify information about how a given model should be simulated. The annotation data can be represented in ``record`` form as:
es: La anotación ``experiment`` se usa para especificar información sobre cómo debe simularse un determinado modelo. La información de la anotación puede representarse en forma de ``record``:

source: **Type: Declaration Annotation (applies to parameters)**
es: **Type: Declaration Annotation (aplica a los parámetros)**

source: The ``Evaluate`` annotation indicates to a Modelica compiler that the value of a given ``parameter`` can be transformed into a ``constant`` at compile time. In other words, it indicates that the user does not require the ability to change the value of the ``parameter`` from one simulation to the next.
es: La anotación ``Evaluate`` indica a un compilador Modelica que el valor de un determinado ``parametro`` puede ser transformado en una ``constante`` en tiempo de compilación. En otras palabras, indica que el usuario no necesita la posibilidad de cambiar el valor de un ``parametro`` de una simulación a otra.

source: The motivation behind having such an annotation is that it allows the Modelica compiler to assume many things about the ``parameter`` during model compilation that it otherwise couldn't. These assumptions might restrict the system of equations in such a way that the underlying systems of equations are easier to solve than in the general case where the parameter could take on a range of values.
es: La motivación detrás de tener este tipo de anotación es que permite al compilador Modelica asumir muchas cosas sobre el ``parametro`` durante la compilación del modelo que de otra manera no podría. Estas suposiciones pueden restringir el sistema de ecuaciones de forma que el sistema de ecuaciones subyacente sea más sencillo de resolver que en el caso general donde el parámetro puede tomar un rango de valores.

source: The ``Evaluate`` annotation is simply a ``Boolean`` variable (``true`` indicating that the ``parameter`` value can be transformed into a ``constant``). It is used in an annotation as follows:
es: La anotación ``Evaluate`` es simplemente una variable ``booleana`` (``true`` indica que el valor del ``parámetro`` puede transformarse en una ``constante``). Se utiliza en una anotación de la siguiente manera:

source: The ``HideResult`` annotation is used to indicate that the solution for a given variable is not of interest to the analyst. By setting the value of ``HideResult`` to ``true``, the model developer is indicating to the Modelica compiler that it need not store the annotated variable in any simulation results that are produced. This can save both simulation time and disk space because it avoids writing out data that will never be viewed.
es: La anotación ``HideResult`` se usa para indicar que la solución de una determinada variable no es de interés para el analista. Estableciendo el valor de ``HideResult`` como ``true``, el desarrollador del modelo está indicando al compilador de Modelica que no es necesario almacenar la variable anotada en ninguno de los resultados de simulación que se produzcan. Esto puede ahorrar tiempo de simulación y espacio en disco porque evita escribir datos que nunca se visualizarán.

source: The ``HideResult`` annotation would be used as follows:
es: La anotación ``HideResult`` se usa de la siguiente manera:
