Repository: Claire-Eleutheriane/educational_book
Catalog: ModelicaBook/text/locale/*/LC_MESSAGES/behavior/equations/electrical.po
Languages: ar, es

source: An Electrical Example
ar: مثال كهربي
es: Un ejemplo eléctrico

source: Let us return now to an engineering context. For readers who are more familiar with electrical systems, consider the following circuit:
ar: دعونا الآن نعد إلى الحديث عن مجال الهندسة. لأولئك الذين يألفون النظم الكهربية، لينظروا إلى الدائرة الكهربية التالية:
es: Volvamos ahora al contexto de la ingeniería. Para lectores a los que les resulten más familiares los sistemas eléctricos, consideremos el siguiente circuito:

source: Low-Pass RLC Filter
ar: مرشح تمرير الترددات المنخفضة من النوع RLC
es: Filtro pasabajo RLC

source: Suppose we want to solve for: :math:`V`, :math:`i_L`, :math:`i_R` and :math:`i_C`. To solve for each of the currents :math:`i_L`, :math:`i_R` and :math:`i_C`, we can use the equations associated with inductors, resistors and capacitors, respectively:
ar: فلنفرض أننا نريد حل هذه المسألة بالنسبة إلى: :math:`V` و :math:`i_L` و :math:`i_R` و :math:`i_C`. لحل المسألة بالنسبة إلى التيارات الكهربية math:`i_L` و :math:`i_R` و :math:`i_C` يمكننا استخدام المعادلات الخاصة بملفات الحث والمقاومات والمكثفات:
es: Supongamos que queremos solucionarlo para: :math:`V`, :math:`i_L`, :math:`i_R` y :math:`i_C`. Para solucionar cada una de las corrientes :math:`i_L`, :math:`i_R` y :math:`i_C`, podemos utilizar las ecuaciones asociadas con induciones, resistencias y condensadores, respectivamente:

source: where :math:`V_b` is the battery voltage.
ar: حيث جهد البطارية هو :math:`V_b`
es: donde :math:`V_b` es el voltage de la batería.

source: Since we have only 3 equations, but 4 variables, we need one additional equation. That additional equation is going to be Kirchoff's current law:
ar: لدينا فقط 3 معادلات في حين أن لدينا 4 متغيرات ولذلك فإننا نحتاج إلى معادلة واحدة أخرى. والمعادلة الإضافية تأتي من قانون كيرشوف للتيار الكهربي:
es: Como tenemos solamente 3 ecuaciones, pero 4 variables, necesitamos una ecuación adicional. Esta ecuación adicional será la ley de la corriente de Kirchoff:

source: Now that we have determined the equations and variables for this problem, we will create a basic model (including physical types) by translating the equations directly into Modelica. But in a later section on :ref:`electrical-components` we will return to this same circuit and demonstrate how to create models by dragging, dropping and connecting models that really look like the circuit components in our :ref:`low-pass-rlc`.
ar: والآن نحن قد حددنا المعادلات والمتغيرات لهذه المسألة، وسنبدأ في إنشاء النموذج الأساسي (والذي يتضمن الأنواع الفيزيائية) عن طريق ترجمة المعادلات إلى لغة مودليكا مباشرة. ولكن في قسم لاحق بعنوان المكونات الكهربية :ref:`electrical-components` سوف نعود إلى نفس الدائرة لنبين كيفية إنشاء النماذج بواسطة السحب والإفلات والتوصيل بين نماذج قد تشبه تماما مكونات الدائرة في مرشح تمرير الترددات المنخفضة :ref:`low-pass-rlc` الذي لدينا.
es: Ahora que ya hemos determinado las ecuaciones y variables de este problema, crearemosun modelo básico (incluyendo tipos físicos) trasladando las ecuaciones directamente a Modelica. Pero en una sección posterior en :ref:`electrical-components` volveremos a este mismo circuito y demostraremos cómo crear modelos arrastrando, soltando y conectando modelos que realmente tienen el mismo aspecto que los componentes del circuito de nuestro :ref:`low-pass-rlc`.

source: But for now, we will build a model composed simply of variables and equations. Such a model could be written as follows:
ar: ولكن حاليا، سنبني نموذج يتكون ببساطة من متغيرات ومعادلات. ويمكن كتابة مثل هذا النموذج كما يلي:
es: Pero por ahora, construiremos un modelo compuesto simplemente por variables y ecuaciones. Este modelo puede escribirse como sigue:

source: Let's go through this example bit by bit and reinforce the meaning of the various statements. Let's start at the top:
ar: دعونا نمشي خلال هذا المثال خطوة خطوة لنؤكّد على معاني العبارات المختلفة. فلنبدأ من الأعلى:
es: Sigamos con este ejemplo poco a poco y reforzando el significado de las diferentes sentencias. Empecemos por la parte superior:

source: Here we see that the name of the model is ``RLC1``. Furthermore, a description of this model has been included, namely ``"A resistor-inductor-capacitor circuit model"``. Next, we introduce a few physical types that we will need:
ar: نرى هنا أن اسم النموذج هو ``RLC1``. علاوة على ذلك، وصف هذا النموذج تم إدراجه باسم ``"A resistor-inductor-capacitor circuit model"``. بعدها، قدّمنا بعض الأنواع الفيزيائية التي نحتاجها
es: Aquí vemos que el nombre del modelo es ``RLC1``. Además, se ha incluido una descripción de este modelo, a saber ``"A resistor-inductor-capacitor circuit model"``. Después, introducimos unos pocos tipos físicos que necesitaremos:

source: Each of these lines introduces a physical type that specializes the built-in ``Real`` type by associating it with a particular physical unit. Then, we declare all of the ``parameter`` variables in our problem:
ar: كل واحد من هذه السطور يقدّم نوعا فيزيائيا وذلك بتخصيص النوع المُضَمَّن (النوع المبني ضمن لغة مودليكا) والمسمى عدد حقيقي ``Real`` عن طريق ربطه بوحدة فيزيائية معينة. وبعدها، قمنا بتعريف كل متغيرات المعاملات في المسألة:
es: Cada una de estas líneas introduce un tipo físico que especializa el tipo predefinido ``Real`` asociandolo con una unidad física particular. Después, declaramos todas las variables ``parameter`` en nuestro problema:

source: These ``parameter`` variables represent various physical characteristics (in this case, voltage, inductance, resistance and capacitance, respectively). The last variables we need to define are the ones we wish to solve for, *i.e.*,
ar: متغيرات ``المعاملات`` هذه تعبر عن الخواص الفيزيائية (والتي هي في هذه الحالة الجهد الكهربي، والحث الكهربي للملف والمقاومة الكهربية، وسعة المكثف الكهربي، على الترتيب). أما المتغيرات الأخيرة التي نحتاج إلى تعريفها فهي تلك التي نرغب في إيجاد حل لها، *مثل*،
es: Estas variables ``parameter`` representan diferentes características físicas (en Las últimas variables que necesitamos definir son aquellas que queremos solucionar, *es decir*,

source: Now that all the variables have been declared, we add an ``equation`` section to the model that specifies the equations to use when generating solutions for this model:
ar: والآن بعد أن تم تعريف كل المتغيرات، يمكننا إضافة قسم المعادلة ``equation`` للنموذج والذي يحدد المعادلات التي نستخدمها لتوليد الحلول لهذا النموذج.
es: Ahora que todas las variables se han declarado, añadimos una sección ``equation`` al modelo que especifica las ecuaciones a usar cuando se generen soluciones a este modelo:

source: Finally, we close the model by creating an ``end`` statement that includes the ``model`` name (*i.e.*, ``RLC1`` in this case):
ar: في النهاية، نغلق النموذج بعبارة النهاية ``end`` والتي تتضمن اسم النموذج (*والذي هو* ``RLC1`` في هذه الحالة:)
es: Finalmente, cerramos el modelo creando una sentencia ``end`` que incluye el nombre del ``modelo`` (*es decir*, ``RLC1`` en este caso):

source: One thing that distinguishes this example from the previous examples is the fact that it contains more equations. As with the ``NewtonCooling`` example, we have some equations with expressions on both the left and right hand sides. We also have a mix of differential equation (ones that include the derivative of a variable) and others that are simply algebraic equations.
ar: أحد الأشياء التي تميز هذا المثال عن الأمثلة السابقة هو حقيقة أنه يحتوى على معادلات أكثر. وكما في مثال ``NewtonCooling`` لدينا هنا أيضا بعض المعادلات التي بها تعبيرات رياضية في الطرفين الأيمن والأيسر. ونحن أيضا لدينا تشكيلة من المعادلات التفاضلية (والتي تحتوى على تفاضل لمتغير) ومعادلات أخرى هي ببساطة معادلات جبرية.
es: Una cosa que distingue este ejemplo de los ejemplos anteriores es el hecho de que contiene más ecuaciones. Como con el ejemplo ``NewtonCooling``, tenemos algunas ecuaciones con expresiones en ambos lados el derecho y el izquierdo. Tenemos también una mezcla de ecuaciones diferenciales (unas que incluyen la derivada de una variable) y otras que son simplemente ecuaciones algebraicas.

source: This further emphasizes the point that in Modelica it is not necessary to put the system of equations into the so-called "explicit state-space form" required in some modeling environments. We could, of course, rearrange the equations into a more explicit form like this:
ar: وهذا أيضا يوضح نقطة أنه ليس من الضروري في لغة مودليكا أن توضع معادلات النظام في الصيغة المسماة "صيغة فضاء الحالة الصريحة" والتي نحتاجها في بعض البيئات البرمجية الخاصة بالنمذجة. وبالطبع يمكننا إعادة ترتيب المعادلات لتصبح في صورة صريحة أكثر مثل هذه:
es: Esto enfatiza más el hecho de que en Modelica no es necesario poner el sistema de ecuaciones en la llamada "forma de espacio-estado explicita" requerida en algunos entornos de modelado. Podemos, por supuesto, reorganizar las ecuaciones en una forma más explícita como esta:

source: But the important point is that with Modelica, we do not need to perform such manipulations. Instead, we are free to write the equations in whatever form we chose.
ar: ولكن النقطة المهمة هنا هي أننا مع لغة مودليكا لا نحتاج إلى إجراء هذه التعاملات الرياضية. وبدلا من ذلك، يمكننا بحرية كتابة المعادلات في أي صورة نختارها.
es: Pero el tema importante es que con Modelica, no necesitamos llevar a cabo estas manipulaciones. En cambio, somos libres de escribir las ecuaciones en cualquier forma que escojamos.

source: Ultimately, these equations will probably need to be manipulated into a form like explicit state-space form. But if such manipulations are necessary, it will be the responsibility of the Modelica compiler, not the model developer, to perform these manipulations. This eliminates the need for the model developer to deal with this tedious, time consuming and error prone task.
ar: ولن نحتاج إطلاقا إلى التعامل الرياضي مع هذه المعادلات لنحولها إلى صيغة معينة مثل صيغة فضاء الحالة الصريحة. ولكن إن كانت هذه التعاملات الرياضية ضرورية فهي مسؤولية مُصَرِّف (مترجم) مودليكا أن يقوم بإجراء هذه التعاملات الرياضية وليس مطوّر النموذج. وهذا يلاشي الاحتياج إلى أن يقوم مطوّر النموذج بهذه المهمة المملّة والمستهلكة للوقت والمعَرَّضة للأخطاء.
es: Finalmente, es probable que sea necesario manipular estas ecuaciones para obtener una forma explícita como el espacio-estado. Pero si estas manipulaciones son necesarias, será responsabilidad del compilador de Modelica, no del desarrollador del modelo, hacer estas manipulaciones. Esto elimina la necesidad del desarrollador del modelo de tratar con esta tarea tediosa, larga y propensa a errores.

source: The ability to keep equations in their "textbook form" is important because, as we will show in later sections, we eventually want to get to the point where these equations are "captured" in individual components models. In those cases, we won't know (when we create the component model) exactly what variable each equation will be used to solve for. Making such manipulations the responsibility of the Modelica compiler not only makes the model development faster and easier, but it dramatically improves the **reusability** of the models.
ar: إن قدرة لغة مودليكا على الحفاظ على المعادلات مكتوبة "بصيغة الكتاب الدراسي" هي شيء مهم لأنه كما سنريكم في الأقسام التالية، فنحن في النهاية نريد أن نصل إلى النقطة التي تم التقاط الصورة لهذه المعادلات في داخل نماذج المكونات المُفرَدَة وفي تلك الحالات نحن لا ندري (متى قمنا بإنشاء نموذج لأحد المكونات) ولا ما هو بالضبط متغيّر كل معادلة نستخدمها للحل. وإجراء مثل هذه التعاملات الرياضية هو مسئولية مُصَرِّف (مترجم) مودليكا وهذا لا يجعل تطوير النماذج أسهل وأسرع فحسب ولكن يحسّن أيضا بشكل جذري **إعادة استخدام** النماذج.
es: La habilidad para mantener las ecuaciones en su "formato de libro de texto" es importante porque, como mostraremos en secciones posteriores, finalmente queremos llegar al punto en el que estas ecuaciones serán "capturadas" en modelos de componentes individuales. En estos casos, no sabremos (cuando creemos el modelo de componente) exactamente qué ecuación se usará para resolver cada variable. Haciendo que estas manipulaciones sean responsabilidad del compilador de Modelica no solo hace que el desarrollo de modelos sea más rápido y sencillo, sino que mejora drásticamente la **reusabilidad** de los modelos.

source: The following figure shows the dynamic response of the ``RLC1`` model:
ar: الشكل المقابل يظهر الاستجابة الديناميكية لنموذج ``RLC1``:
es: La siguiente figura muestra la respuesta dinámica del modelo ``RLC1``:

source: Expanding on these electrical examples
ar: للاطلاع على المزيد من الأمثلة الكهربية
es: Ampliando estos ejemplos eléctricos

source: As mentioned in the :ref:`preface`, the structure of this book allows us to explore a more hypermedia based approach in which readers are encouraged to process the material that is most aligned with their goals and interests. The next chapter will present a model whose equations are derived from a mechanical system. If you would prefer instead to see this electrical example extended to include more complex behavior, you may want to skip ahead to the :ref:`switched-rlc` example.
ar: كما ذكرنا في التقديم :ref:`preface` فبناء هذا الكتاب يسمح لنا باستكشافه بنهج مبني على الروابط التشعبية والذي يتم تشجيع القرّاء من خلاله على التعامل مع هذه المادة بما يناسب أهداف واهتمامات كل منهم. الفصل التالي سيقدّم نموذجا معادلاته مستنبطة من نظام ميكانيكي. إذا كنت تفضّل بدلا من ذلك أن ترى امتدادا لهذا المثال الكهربي يكون فيه سلوك أكثر تعقيدا، فيمكنك الذهاب مباشرة إلى المثال :ref:`switched-rlc` -Used Terms المصطلحات المستخدمة- expression تعبير رياضي low-pass filter مرشح تمرير الترددات المنخفضة explicit صريحة inductors ملفات الحث الكهربي resistors مقاومات capacitors مكثفات dragging and dropping السحب والإفلات connecting التوصيل statement عبارة model developer مطوّر النموذج environment بيئة برمجية manipulations التعاملات الرياضية dynamic responce الاستجابة الديناميكية
es: Como se menciona en el :ref:`preface`, la estructura de este libro nos permite explorar un enfoce más basado en hipermedia en el que se anima los lectores y lectoras a procesar el material que está más alineado con sus objetivos e intereses. El próximo capítulo presentará un modelo cuyas ecuaciones se derivan de un sistema mecánico. Si en su lugar se prefiere ver este ejemplo eléctrico extendido incluyendo comportamiento más complejo, es posible que desee pasar directamente al ejemplo :ref:`switched-rlc`.

source: state-space form
ar: صيغة فضاء الحالة
es: forma espacio-estado
