Repository: Claire-Eleutheriane/educational_book
Catalog: ModelicaBook/text/locale/*/LC_MESSAGES/behavior/equations/equations.po
Languages: es

source: Equations
es: Ecuaciones

source: Although equations are probably the single most important mathematical aspect of Modelica, they are also the simplest to explain.
es: Aunque las ecuaciones son problablemente el aspecto matemático más importante de Modelica, son también el más fácil de explicar.

source: Basic Equations
es: Ecuaciones básicas

source: There are really no complicated semantics to explain about equations. All equations are composed of a left hand expression and a right hand expression separated by an equals sign, *i.e.,*
es: Realmente no hay semantica complicada que explicar sobre las ecuaciones. Todas las ecuaciones están compuestas de una expresión a la izquierda y otra expresión a la derecha separadas por el signo de igualdad, *es decir,*

source: Through the examples presented in this chapter, the reader has been exposed to this pattern over and over again in each example. The only real deviation from the syntax shown above is the case where a description of the equation is included as well, *e.g.,*
es: A través de los ejemplos presentados en este capítulo, el lector ha sido expuesto a esta pauta una y otra vez en cada ejemplo. La única desviación real respecto a la sintaxis mostrada arriba es el caso en el que se incluye también una descripción de la ecuación, *p.ej*,

source: As was pointed out previously, the left hand and right hand sides of an equation in Modelica are expressions, not assignments. In other words (and in contrast to most programming languages), the left hand side does **not** have to be a variable (as we can see in the case of Newton's law above).
es: Como se ha señalado previamente, los lados izquiero y derecho de una ecuación en Modelica son expresiones, no asignaciones. En otras palabras (y a diferencia de la mayoría de lenguajes de programación), el lado derecho **no** tiene que ser una variable (como podemos ver en el caso de la ley de Newton arriba).

source: Initial Equations
es: Ecuaciones iniciales

source: As we saw in many of the examples in this chapter, it is possible to specify equations within a model to be used to solve for initial conditions. This entire topic of initialization will be discussed in detail in the next section, titled :ref:`initialization`. For now, all we will say on this topic is that if an equation is to be applied *only* to solve for initial conditions, the ``equation`` section must be qualified by the ``initial`` keyword as follows:
es: Como hemos visto en muchos ejemplos en este capítulo, es posible especificar ecuaciones en un modelo para ser usadas al solucionar las condiciones iniciales. Este tema de la inicialización completo se discutirá en detalle en la siguiente sección, titulado :ref:`initialization`. Por ahora, todo lo que diremos sobre este tema es que si una ecuación debe aplicarse *solamente* para solucionar las condiciones iniciales, la sección ``equation`` debe ser calificado por la palabra clave ``initial`` tal como sigue:

source: Conditional Equations
es: Ecuaciones condicionales

source: In the next chapter, we'll discuss how to use ``if`` statements to represent conditional behavior. It is worth getting ahead of ourselves a little bit to point out that equations can be conditional. There are really two forms of conditional equations. The first is the balanced form, *e.g.,*
es: En el siguiente capítulo, discutiremos sobre cómo usar las sentencias ``if`` para representar comportamiento condicional. Merece la pena adelantarnos a nosotros mismos un poco para señalar que las ecuaciones pueden ser condicionales. Hay realmente dos formas de ecuaciones condicionales. La primera es la forma equilibrada, *p.ej.*

source: In the balanced case, the number of equations is always the same (1 in the code above), but *which* equation can change. This is important because to simulate a model in Modelica, the number of variables must equal the number of equations and the number of equations must be fixed during the simulation.
es: En el caso equilibrado, el número de ecuaciones es siempre el mismo (1 en el código anterior), pero *cuyas* ecuaciones pueden cambiar. Esto es importante porque para simular un modelo en Modelica, el número de variables debe ser igual al número de ecuaciones y el número de ecuaciones debe ser fijo durante la simulación.

source: The other type of conditional equations are ones where the number of equations is unbalanced. This means that the number of equations on the ``if`` side may not be equal to the number of equations on the ``else`` side (like it was in the balanced case, previously).
es: El otro tipo de ecuaciones condicionales son aquellas en las que el número de ecuaciones está desequilibrado. Esto significa que el número de ecuaciones en el lado del ``if`` puede no ser igual al número de ecuaciones el el lado del ``else`` (como lo era anteriormente en el caso balanceado).

source: But remember, the number of equations cannot change during a simulation. So how is it then that the number of equations can be different from the ``if`` side to the ``else`` side? It can only happen if **the value of the conditional expression cannot change during the simulation**. In order to be able to ensure that the conditional expression can never change, it is necessary that all variables in the conditional expression have so-called *parametric variability*.
es: Pero hay que recordar que el número de ecuaciones no puede cambiar durante una simulación. ¿Entonces cómo puede ser que el número de ecuaciones pueda ser diferente en el lado del ``if`` respecto al lado del ``else``? Solamente puede suceder si **el valor de la expresión condicional no puede cambiar durante la simulación**. Para poder asegurar que la expresión condicional no puede cambiar nunca, es necesario que todas las variables en la expresión condicional tengan la llamada *variabilidad paramétrica*.

source: Remember in our discussion of :ref:`variability` the fact that variables with the ``parameter`` qualifier cannot change during a simulation? If a variable with the ``parameter`` qualifier cannot change during a simulation and all the variables in an expression have this parametric variability then the entire expression must also have parametric variability (*i.e.,* the value of the expression cannot change during a simulation).
es: ¿Recordais de nuestra discusión sobre :ref:`variability` el hecho de que las variables con el calificador ``parameter`` no pueden cambiar durante una simulación? Si una variable con el calificador ``parameter`` no puede cambiar durante una simulación y todas las variables en una expresión tienen esta variabilidad paramétrica entonces la expresión entera tiene que tener también variabilidad paramétrica (*es decir,* el valor de la expresión no puede cambiar durante la simulación).

source: At this point, you might be asking yourself why this unbalanced case would be useful? Again, we are getting ahead of ourselves here, but one use case would be the conditional application of initial equations, *e.g.,*
es: En este punto, puede que os esteis preguntando a vosotros mismoa para qué puede ser útil este caso desbalanceado. De nuevo, nos estamos adelantando, pero un caso de uso puede ser la aplicación condicional de ecuaciones iniciales, *por ejemplo,*

source: In other words, if the Boolean parameter ``steady_state`` is true, then the initial equations are enforced. But if the parameter is false, they are not. The conditional expression here clearly has parametric variability because the expression contains only a variable and that variable is a parameter.
es: En otras palabras, si el parámetro booleano ``steady_state`` es verdadero, entonces las condiciones iniciales se fuerzan. Pero si el parámetro es falso, no lo son. Aquí la expresión condicional tiene variabilidad parametrica porque la expresión contiene solamente una variable y esa variable es un parametro.

source: That's all we'll say on this topic for now, since discrete and conditional behavior will be discussed in detail in the :ref:`next chapter <discrete-behavior>`.
es: Esto es todo lo que diremos sobre este tema por ahora, ya que el comportamiento condicional y discreto se tratará en detalle en el próximo capítulo :ref:`next chapter <discrete-behavior>`.

source: parametric variability
es: variabilidad paramétrica
