Repository: Claire-Eleutheriane/educational_book
Catalog: ModelicaBook/text/locale/*/LC_MESSAGES/behavior/equations/first_order.po
Languages: ar, es

source: Simple First Order System
ar: نظام بسيط من الرتبة الأولى
es: Sistema de primer orden simple

source: Let us consider an extremely simple differential equation:
ar: دعونا نتناول معادلة تفاضلية غاية في البساطة
es: Consideremos una ecuación diferencial extremadamente simple:

source: Looking at this equation, we see there is only one variable, :math:`x`. This equation can be represented in Modelica as follows:
ar: بالنظر إلى هذه المعادلة، نرى أنه يوجد بها متغير واحد هو :math:`x` ويمكن تمثيل هذه المعادلة في لغة مودليكا كالتالي:
es: Mirando a esta ecuación, podemos ver que solamente hay una variable, :math:`x`. Esta ecuación puede representarse en Modelica de la siguiente manera:

source: This code starts with the keyword ``model`` which is used to indicate the start of the model definition. The ``model`` keyword is followed by the model name, ``FirstOrder``. This, in turn, is followed by a declaration of all the variables we are interested in.
ar: يبدأ الكود البرمجي بالكلمة المفتاحية ``model`` والتي تستخدم لتبين أننا سنبدأ بتعريف نموذج. ويأتي بعد كلمة ``model`` اسم النموذج وليكن ``FirstOrder`` وهذا بدوره، يليه تعريف كل المتغيرات التي تهمنا.
es: Este código comienza con la palabra clave ``model`` que se usa para indicar el inicio de la definición del modelo. A la palabra clave ``model`` le sigue el nombre del modelo, ``FirstOrder``. A éste, a su vez, le sigue la declaración de todas las variables en las que estamos interesados.

source: Since the variable :math:`x` in our equation is clearly meant to be a continuous real valued variable, its declaration in Modelica takes the form ``Real x;``. The ``Real`` type is just one of the types we can use (a more complete description of the various possibilities will be discussed in the upcoming section on :ref:`variables`).
ar: بما أن المتغير :math:`x` في معادلتنا هو متغير ذو قيمة حقيقية ومستمرة فإن تعريفه في لغة مودليكا يكون على الصورة ``Real x;``. إن النوع الذي نسميه عدد حقيقي ``Real`` هو نوع واحد من الأنواع التي يمكن استخدامها (وسوف نناقش الإمكانيات الأخرى المختلفة بشكل أكثر كمالا في قسم قادم عن المتغيرات :ref:`variables`).
es: Como la variable :math:`x` en nuestra ecuación se entiende claramente que es una variable continua real, su declaración en Modelica toma la forma ``Real x;``. El tipo ``Real`` es solamente uno de los tipos que podemos usar (una descripción más completa de las diferentes posibilidades se tratará en la siguiente sección sobre :ref:`variables`).

source: Once all the variables have been declared, we can begin including the equations that describe the behavior of our model. In this case, we can use the ``der`` operator to represent the time derivative of ``x``. Thus,
ar: بعد تعريف كل المتغيرات، يمكننا البدء في كتابة المعادلات التي تصف السلوك الرياضي للنموذج. في هذه الحالة، يمكننا استخدام مؤثر التفاضل ``der`` لتمثيل تفاضل ``x`` بالنسبة إلى الزمن. وهذا يعني أن:
es: Una vez se han declarado todas las variables, podemos comenzar incluyendo las ecuaciones que describen el comportamiento de nuestro modelo. En este caso, podemos usar el operador ``der`` para representar la derivada temporal de ``x``. Así,

source: is equivalent to:
ar: هو مناظر ل:
es: es equivalente a:

source: Unlike most programming languages, we don't approach code like this as a "program" that can be interpreted as a set of instructions to be executed one after the other. Instead, we use a Modelica compiler to transform this model into something that we can simulate. This simulation step essentially amounts to solving (usually numerically) the equation and providing a solution trajectory like this:
ar: بخلاف معظم لغات البرمجة، نهج الكود البرمجي هنا لا يمثل "برنامجا" عاديا يمكن تفسيره عن طريق مجموعة من الأوامر التي يتم تنفيذها بالتتابع واحدا تلو الآخر. وبدلا من ذلك نحن نستخدم مُصَرِّف (مترجم) مودليكا الذي يحوّل لنا هذا النموذج إلى صورة أخرى تمكننا من عمل المحاكاة لهذا النموذج. وخطوة المحاكاة تشمل بشكل أساسي عددا من الحلول للمعادلات (والتي عادة ما تكون حلولا عددية) وتعطينا منحنى للحل مثل هذا:
es: A diferencia de la mayoría de lenguajes de programación, no avordamos un código como este como un "programa" que puede ser interpretado como un conjunto de instrucciones para ser ejecutadas una tras otra. En su lugar, nosotros usamos un compilador de Modelica para transformar este modelo en algo que podamos simular. Este paso de simulación esencialmente equivale a resolver la ecuación (por lo general numéricamente) y proporcionar una trayectoria solución como ésta:

source: This gives you the first initial hint at one of the compelling aspects about using a modeling language to describe mathematical behavior. We didn't need to describe how to solve this differential equation. The focus is entirely on behavior. As we work our way through more complex examples, we will see that **much of the tedious work involving the solution process is handled automatically by the Modelica compiler**.
ar: وهذا يعطينا نبذة عن أحد الجوانب المُقْنِعة لاستخدام لغة مودليكا لوصف السلوك الرياضي. فنحن لا نحتاج إلى وصف كيفية حل هذه المعادلات التفاضلية. ومن ثم ، سينصب تركيزنا الأساسي على السلوك الرياضي. وأثناء عملنا وخلال طريقنا نحو أمثلة أكثر تعقيدا، سوف نرى أن **الكثير من الأعمال المملة مثل عملية حل المعادلات سوف يقوم بها بشكل آلي مُصَرِّف (مترجم) مودليكا.**
es: Esto os da el primer incidio sobre uno de los aspectos convincentes sobre el uso de un lenguaje de modelado para describir comportamientos matemáticos. No necesitamos describir cómo resolver esta ecuación diferencial. La atención se centra exclusivamente en el comportamiento. A medida que avancemos en nuestro camino a través de los ejemplos más complejos veremos que **mucho del tedioso trabajo que implica el proceso de resolución es manejado automáticamente por el compilador de Modelica**.

source: Adding Some Documentation
ar: إضافة بعض التوثيق
es: Añadiendo algo de documentación

source: Now that we've solved this simple mathematical equation, let's turn our attention briefly to how we can make the model a bit more readable. Consider the following model:
ar: لقد حللنا الآن هذه المعادلة الرياضية البسيطة، فدعونا نهتم قليلا بكيفية جعل النموذج أكثر سهولة في قراءته. دعونا ننظر في النموذج التالي:
es: Ahora que hemos resuelto esta simple ecuación matemática, vamos a centrar nuestra atención brevemente sobre cómo podemos hacer el modelo un poco más legible. Consideremos el siguiente modelo:

source: Note the quoted text in this model.
ar: لاحظ النص الذي بداخل أقواس الاقتباس في هذا النموذج.
es: Atención al texto entrecomillado en este modelo.

source: It is important to understand that the quoted text blocks, called "strings" in computer science, are **not** comments. They are "descriptive strings" and, unlike comments, they cannot be added in arbitrary places. Instead, they can only be inserted in specific places to provide additional documentation about the elements of the model they are associated with.
ar: من المهم أن نفهم أن النصوص التي بداخل أقواس الاقتباس تسمى في علوم الحاسب مقاطع (سلاسل محارف) "strings" و**لا تسمى** تعليقات. فهي مقاطع (سلاسل محارف) وصفية "descriptive strings" وبخلاف التعليقات، لا يمكن وضعها في أي مكان اختياري. وبدلا من ذلك، يمكن إدخالها فقط في أماكن محددة لإعطاء تفاصيل إضافية عن عناصر النموذج المتعلقة بها.
es: Es importante entender que los bloques de texto entre comillas, llamados "strings" en informática, **no** son comentarios. Son "strings descriptivos" y, a diferencia de los comentarios, no pueden ser añadidos en lugares arbitrarios. En vez de eso, sólo se pueden insertar en lugares específicos para proporcionar documentación adicional sobre los elementos del modelo a los que están asociados.

source: For example, the first string "A simple first order differential equation" is used to describe what this is a model of. Note how it follows the name of the model. If you wish to include such documentation about the model, it must appear immediately after the model name as shown.
ar: على سبيل المثال، المقطع الأول (سلسلة المحارف الأولى) "A simple first order differential equation" تستخدم لوصف ماهية هذا النموذج وعن ماذا هو. لاحظ أنها تأتي بعد اسم النموذج. إذا كنت تريد أن تضيف هذا التوثيق عن النموذج، فيجب أن تكتبه بعد اسم النموذج مباشرة كما هو مبين.
es: Por ejemplo, el primer string "A simple first order differential equation" se usa para describir qué es este modelo. Observa cómo sigue al nombre del modelo. Si quieres incluir esta documentación sobre el modelo, debe aparecer inmediantamente tras el nombre del modelo tal como se muestra.

source: As we will see later, this kind of documentation can be used by tools in many ways. For example, when searching for models, a tool may use these descriptive strings when identifying matches. This text may also be associated with a graphical representation of the models. And, of course, this kind of documentation is very useful for anybody reading the model.
ar: وكما سنرى لاحقا، فإن هذا النوع من التوثيق يمكن استخدامه بعدة طرق عن طريق الأدوات البرمجيّة فعلى سبيل المثال، عند البحث عن النماذج، يمكن للأداة البرمجيّة استخدام سلاسل الحروف الوصفية لتحديد مدى التطابق. قد يكون هذا الكتاب متعلقا بالتمثيل الرسومي للنماذج كذلك. وبالتالي سيكون هذا النوع من التوثيق مفيدا للغاية لكل من يقرأ النموذج بالتأكيد.
es: Como veremos más tarde, este tipo de documentación puede ser usada por las herramientas de muchas formas. Por ejemplo, cuando se buscan modelos, la herramienta puede utilizar estas cadenas descriptivas para identificar coincidencias. Este texto también puede ser asociado con una representación gráfica de los modelos. Y, por supuesto, este tipo de documentación es muy útil para cualquiera que lea el modelo.

source: As this example demonstrates, there are other places that the descriptive text can appear. For example, it may be included after the declaration of a variable or equation to document them.
ar: وكما يوضح هذا المثال، فإن هناك أماكن أخرى قد يظهر فيها النص الوصفي. فعلى سبيل المثال، قد يتم إدراج هذا النص بعد تعريف المتغير أو المعادلة التي يعطي النص الوصفي توثيقا عنها.
es: Como demuestra este ejemplo, hay otros sitios en los que puede aparecer el texto descriptivo. Por ejemplo, puede ser incluido tras la declaración de una variable o ecuación para documentarlas.

source: Initialization
ar: الابتداء
es: Inicialización

source: As we have seen already, Modelica allows us to describe model behavior in terms of differential equations. But the initial conditions we choose are just as important as the equations.
ar: كما رأينا للتو، فإن لغة مودليكا تسمح بوصف السلوك الرياضي للنموذج عن طريق المعادلات التفاضلية. ولكن بقدر أهمية المعادلات بقدر أهمية اختيارنا للظروف الابتدائية initial conditions.
es: Como ya hemos visto, Modelica nos permite describir el comportamiento de un modelo en forma de ecuaciones diferenciales. Pero las condiciones iniciales que escogemos son tan importantes como las ecuaciones.

source: For this reason, Modelica also provides constructs for describing the initialization of our system of equations. For example, if we wanted the initial value of ``x`` in our model to be *2*, we could add an ``initial equation`` section to our model as follows:
ar: ولهذا السبب، فلغة مودليكا تعطينا أبنية برمجية وعبارات لوصف الابتداء لمنظومة المعادلات. على سبيل المثال، إذا أردنا أن نعطي للمتغير ``x`` قيمة ابتدائية في النموذج مقدارها *2*، فيجب أن نضيف للنموذج قسم معادلة الابتداء ``initial equation`` كما يلي:
es: Por esta razón, Modelica también proporciona construcciones para describir la inicialización de nuestro sistema de ecuaciones. Por ejemplo, si queremos que el valor inicial de ``x`` en nuestro modelo sea *2*, podemos añadir una sección ``initial equation`` a nuestro modelo de la siguiente manera:

source: Note that the only difference between this model and the previous one, presented in the section on :ref:`first-order-doc`, is the addition of the ``initial equation`` section which contains the equation ``x = 2``. In the previous example, the initial value of ``x`` at the start of the simulation was unspecified. Generally speaking, this means that the initial value for ``x`` will be the value of its ``start`` attribute (which is zero by default). However, because each tool uses their own specific algorithms to formulate the final system of equations, it is always best to state initial conditions explicitly, as we have done here. By adding this equation to the ``initial equation`` section, we are explicitly specifying the initial condition for ``x``.
ar: لاحظ أن الاختلاف الوحيد بين هذا النموذج والنموذج السابق الذي قدمناه في قسم "إضافة بعض التوثيق" :ref:`first-order-doc` هو إضافة قسم معادلة الابتداء ``initial equation`` والذي يحتوي على المعادلة ``x = 2``. في المثال السابق، القيمة الابتدائية ل ``x`` عند بداية المحاكاة لم تكن محددة. وعامة، هذا يعني أن القيمة الابتدائية ل ``x`` هي القيمة الابتدائية الافتراضية (والتي تساوي الصفر عادة). ولكن بسبب أن كل أداة برمجيّة تستخدم خوارزمياتها المحددة الخاصة بها لصياغة منظومة المعادلات النهائية، فمن الأفضل دائما أن تذكر الظروف الابتدائية بشكل صريح كما فعلنا نحن هنا. فبإضافة هذه المعادلة لقسم معادلة الابتداء ``initial equation`` فإننا نحدد الظروف الابتدائية ل ``x`` بشكل صريح.
es: Observa que la única diferencia entre este modelo y el anterior, presentado en la sección en :ref:`first-order-doc`, es la incorporación de la sección ``initial equation`` que contiene la ecuación ``x = 2``. En el ejemplo anterior, el valor inicial de ``x`` al comienzo de la simulación estaba sin especificar. En términos generales, esto significa que el valor inicial para ``x`` será el valor de su atributo ``start`` (que es cero por defecto). No obstante, como cada herramienta usa sus algoritmos específicos para formular el sistema de ecuaciones final, siempre es mejor establecer explícitamente las condiciones iniciales, como hemos hecho aquí. Añadiendo esta ecuación a la sección ``initial equation``, estamos especificando explícitamente el valor inicial para ``x``.

source: As a result, the solution trajectory is quite different as we can see in the following figure:
ar: وكنتيجة لذلك، فإن منحنى الحل أصبح مختلفا بعض الشيء كما نرى في الشكل التالي:
es: Como resultado, la trayectoria solución es bastante diferente como podemos ver en la siguiente figura:

source: The model ``FirstOrderInitial`` shows a typical way of initializing a system by providing explicit initial values for the states of the system. In fact, a system of differential equations is incomplete without a specification for how the initial conditions are determined. Our ``FirstOrderInitial`` model would be represented mathematically as:
ar: إن نموذج ``FirstOrderInitial`` يرينا الطريقة المعتادة لتبيين الابتداء لنظام ما عن طريق قيم ابتدائية صريحة لحالات النظام. في الحقيقة، إن منظومة المعادلات التفاضلية تكون ناقصة إذا لم نحدد كيفية ما لإيجاد الظروف الابتدائية. إن نموذج ``FirstOrderInitial`` يمكن تمثيله رياضيا كما يلي:
es: El modelo ``FirstOrderInitial`` muestra una manera típica de inicializar un sistema proporcionando valores inciales explícitos para los estados del sistema. De hecho, un sistema de ecuaciones diferenciales está incompleto sin una especificación sobre cómo se determinan las condiciones iniciales. Nuestro modelo ``FirstOrderInitial`` se representaría matemáticamente como:

source: However, there are many cases where you want a more sophisticated type of initialization. An ``initial equation`` section can contain more than just explicit equations for the initial values of the state variables.
ar: ولكن في كثير من الحالات ستحتاج نوعا أكثر تعقيدا من الابتداء. وقسم معادلة الابتداء ``initial equation`` قد يحتوي على ما هو أكثر من المعادلات الصريحة لتبيين القيم الابتدائية لمتغيرات الحالة.
es: Sin embargo, hay muchos casos en los que querremos un tipo de inicialización más sofisticado. Una sección ``initial equation`` puede contener más que solamente ecuaciones explícitas para los valores iniciales de las variables de estado.

source: For example, we might want our initial conditions to be such that the derivative of :math:`x` was zero at the start of the simulation. In this case, only a bit of trivial algebra is required to realize that this could be accomplished by specifying an initial condition of :math:`x(0)=1`. However, for more complex systems, it is far from trivial to determine the initial state values that would satisfy such a requirement. In those cases, it is possible to express the constraint that :math:`\dot{x}(0)=0` directly in Modelica as follows:
ar: على سبيل المثال، قد نرغب في أن تكون الظروف الابتدائية هي أن يكون التفاضل بالنسبة للزمن ل :math:`x` عند بداية المحاكاة يساوي صفرا. وفي تلك الحالة، نحتاج فقط إلى بعض الجبر البسيط لنعلم أن هذا سيجعل :math:`x(0)=1` كظرف ابتداء. ولكن في الأنظمة الأكثر تعقيدا سيكون الأمر بعيدا عن البساطة فيما يتعلق بتحديد القيم الابتدائية لمتغيرات الحالة والتي تتوافق مع هذا الشرط. وفي تلك الحالات، يمكننا التعبير عن هذا الشرط في لغة مودليكا ب :math:`\dot{x}(0)=0` مباشرة كما يلي:
es: Por ejemplo, podemos querer que nuestras condiciones iniciales sean tal que la derivada de :math:`x` sea cero al inicio de la simulación. En este caso, solo se requiere un poco de álgebra trivial para darse cuenta de que puede lograrse especificando como condición inicial :math:`x(0)=1`. No obstante, para sistemas más complejos, determinar los valores del estado inicial que satisfagan el requisito está lejos de ser trivial. En estos casos, es posible expresar la restricción :math:`\dot{x}(0)=0` directamente en Modelica como sigue:

source: Simulating this system gives the following solution:
ar: ومحاكاة هذا النظام تعطينا الحل التالي:
es: Simular este sistema proporciona la siguiente solución:

source: As we see from these results, the initial derivative of :math:`x` is zero at the start of the simulation and remains zero because there are no external influences acting on this system that would disrupt this equilibrium.
ar: وكما نرى في المثال فإن تفاضل :math:`x` يساوي الصفر عند بداية المحاكاة ويظل صفرا لأنه لا يجد مؤثرات خارجية تؤثر على النظام بحيث تغير هذا الاتزان.
es: Como vemos en estos resultados, la derivada de :math:`x` es cero al inicio de la simulación y se mantiene a cero porque no hay influencias externas actuando en este sistema que puedan interrumpir este equilibrio.

source: This provides a glimpse of the initialization capablities in Modelica. More complete coverage of the initialization topic can be found in the :ref:`initialization` section later in this chapter.
ar: وهذا يعطينا نظرة عن إمكانيات الابتداء في لغة مودليكا. ويمكنك أن تجد تغطية أكمل عن الابتداء لاحقا في هذا الفصل في قسم الابتداء :ref:`initialization`.
es: Esto proporciona una vistazo de las capacidades de inicialización en Modelica. Una cobertura más completa del tema de la inicialización puede encontrarse en la sección :ref:`initialization` más adelante en este capítulo.

source: Experimental Conditions
ar: أحوال التجربة
es: Condiciones experimentales

source: When building a model, the model developer might wish to associate specific experimental conditions with the model. This can be done using something called an ``annotation``. An annotation includes information that is not directly related to the behavior of the model.
ar: عند بناء النموذج، قد يحتاج مطوّر النموذج إلى تحديد أحوال التجربة للنموذج. ويمكن عمل هذا عن طريق ما يسمى بالملاحظة ``annotation`` وتتضمن الملاحظة معلومات لا تتعلق مباشرة بالسلوك الرياضي للنظام.
es: Cuando se construye un modelo, el desarrollador puede querer asociar condiciones experimentales específicas con el modelo. Esto puede hacerse usando algo llamado ``annotation`` (anotación). Una anotación incluye información que no está relacionada directamente con el comportamiento del modelo.

source: For example, experimental conditions describe information like the start time of the simulation, the stop time, solution tolerance and so on. This is not information about the behavior of the model itself, but rather information about how to approach simulating that behavior. Experimental conditions are stored in a model using a specific annotation called the ``experiment`` annotation.
ar: وعلى سبيل المثال، تصف أحوال التجربة معلومات مثل وقت ابتداء المحاكاة، ووقت انتهائها والسماحية (التفاوت المسموح به) وغير ذلك. هذه ليست معلومات عن سلوك النموذج نفسه، ولكنها معلومات عن كيفية المحاكاة لهذا السلوك. وتُوضَع أحوال التجربة في النموذج باستخدام ملاحظة محددة تسمى ملاحظة التجربة ``experiment`` annotation.
es: Por ejemplo, las condiciones experimentales describen información como el instante inicial de la simulación, el instante final, la toleracia de la solución y otros. Esta no es información sobre el comportamiento del modelo, sino más bien información sobre cómo abordar la simulación de ese comportamiento. Las condiciones experimentales se almacenan en un modelo usando una anotación específica llamada ``experiment``.

source: There are four pieces of information that can be specified in an experiment annotation. All of them are optional. The following is a model of our first order system that includes an experiment annotation:
ar: هناك أربع معلومات يمكن تحديدها عن طريق ملاحظة التجربة. والنموذج التالي هو نفسه نموذجنا عن النظام ذو الرتبة الأولى ولكنه يتضمن ملاحظة التجربة:
es: Hay cuatro partes de información que pueden ser especificadas en una anotación experiment. Todas ellas son opcionales. Lo siguiente es un modelo de nuestro sistema de primer orden que incluye una anotación experiment:

source: The following trajectory was simulated using these experimental conditions:
ar: المنحنى التالي تمت محاكاته باستخدام أحوال التجربة:
es: La siguiente trayectoria fue simulada usando esas condiciones experimentales:

source: The trajectory terminates at 8 seconds because the simulator used the ``experiment`` annotation to determine how long to run the simulation.
ar: ينتهي المنحنى عند 8 ثوان ﻷن أداة المحاكاة استخدمت ملاحظة التجربة لتحديد كم من الوقت سيتم فيه تنفيذ المحاكاة.
es: La trayectoria termina a los 8 segundos porque el simulador ha usado la anotación ``experiment`` para determinar durante cuanto tiempo ejecutar la simulación.

source: Annotation Support
ar: دعم الملاحظات
es: Soporte a anotaciones

source: The ``experiment`` annotation is widely supported. But it is important to keep in mind that, in general, a tool is free to ignore any or all annotations.
ar: إن ملاحظة التجربة مدعومة بشكل واسع. ولكن من المهم أن نضع في الحسبان أنه، بشكل عام، يمكن للأداة البرمجيّة المستخدمة تجاهل بعض أو كل ملاحظات التجربة -Used Terms المصطلحات المستخدمة- first order الرتبة الأولى compiler مُصَرِّف (مترجم) numerical solution الحل العددي simulation محاكاة construct بناء برمجي (لاحظ الفرق بينها وبين بُنية برمجية) architecture بُنية برمجية differential operator مؤثر التفاضل differential equation معادلة تفاضلية keyword كلمة مفتاحية documentation توثيق tool أداة برمجيّة code كود برمجي definition تعريف variables متغيرات state variables متغيرات الحالة continious مستمر approach نهج solution trajectory منحنى الحل strings مقاطع (سلاسل محارف) descriptive strings مقاطع وصفية (سلاسل محارف وصفية) descriptive text نص وصفي comment تعليق graphical representation التمثيل الرسومي initial conditions الظروف الابتدائية experiment conditions أحوال التجربة tolerance سماحيّة (التفاوت المسموح به) مثال: تجربة ذات سماحيّة = 1 ثانية هي أقل دقة من تجربة ذات سماحيّة = 1 ملّي ثانية
es: La anotación ``experiment`` es ampliamente soportada. Pero es importante tener en mente que, en general, una herramienta es libre de ignorar cualquiera o todas las anotaciones.

source: model
ar: نموذج
es: modelo

source: der
ar: der مؤثر التفاضل

source: Real
ar: عدد حقيقي

source: descriptive strings
ar: مقاطع وصفية (سلاسل محارف وصفية)
es: string descriptivo

source: initial equation
ar: معادلة الابتداء
es: ecuación inicial

source: annotation
ar: ملاحظة
es: anotación

source: experiment
ar: تجربة
es: experimento
