Repository: Claire-Eleutheriane/educational_book
Catalog: ModelicaBook/text/locale/*/LC_MESSAGES/behavior/equations/mechanical.po
Languages: ar, es

source: A Mechanical Example
ar: مثال ميكانيكي
es: Un ejemplo mecánico

source: If you are more familiar with mechanical systems, this example might help reinforce some of the concepts we've covered so far. The system we wish to model is the one shown in the following figure:
ar: إذا كنت متآلفًا أكثر مع النظم الميكانيكية، قد يساعدك هذا المثال على تقوية وتأكيد بعض المفاهيم التي غطّيناها حتى الآن. النظام الذي نريد أن نقوم بعمل نمذجة له هو النظام المبيّن في الشكل التالي:
es: Si se está más familiarizado con los sistemas mecánicos, este ejemplo podría ayudar a reforzar algunos de los conceptos que hemos tratado hasta ahora. El sistema que queremos modelar es el que se muestra en la siguiente figura:

source: It is worth pointing out how much easier it is to convey the intention of a model by presenting it in schematic form. Assuming appropriate graphical representations are used, experts can very quickly understand the composition of the system and develop an intuition about how it is likely to behave. While we are currently focusing on equations and variables, we will eventually work our way up to an approach (in the upcoming section of the book on :ref:`components`) where **models will be built in this schematic form from the beginning**.
ar: وتجدر الإشارة هنا إلى مدى السهولة في إيصال الهدف المقصود من النموذج التي نحصل عليها عن طريق عرضه في صورة رسم تخطيطي. فلنفرض أننا استخدمنا التمثيلات الرسومية المناسبة، عندها يستطيع الخبراء فهم تركيب النظام بمنتهى السرعة، بل ويستطيعون الحدس والتوقع عن كيفية سلوك هذا النظام. وبينما نحن حاليا نركز على المعادلات والمتغيرات، فإننا أخيرا سوف نصل إلى نهج آخر (في قسم لاحق في الكتاب بعنوان المكونات :ref:`components`) وعند ذلك **سيتم بناء النماذج بواسطة هذه الرسوم التخطيطية من البداية**.
es: Merece la pena señalar lo fácil que es transmitir la intención de un modelo presentándolo de forma esquemática. Suponiendo que se utilizan representaciones gráficas adecuadas, los expertos pueden entender rápidamente la composición del sistema y desarrollar una intuición sobre la forma en que es probable que se comporte. Aunque en estos momentos nos estamos centrando en ecuaciones y variables, trabajaremos finalmente nos iremos abriendo cambino hasta un enfoque (en la siguiente sección del libro :ref:`components`) en el que **los modelos se construirán de esta forma esquemática desde el principio**.

source: For now, however, we will focus on how to express the equations associated with this simple mechanical system. Each inertia has a rotational position, :math:`\varphi`, and a rotational speed, :math:`\omega` where :math:`\omega = \dot{\varphi}`. For each inertia, the balance of angular momentum for the inertia can be expressed as:
ar: أما الآن، فإننا سنركز على كيفية التعبير الرياضي عن المعادلات المتعلقة بنظام ميكانيكي بسيط. كل كتلة قصورية يكون لها موضع زاوي :math:`\varphi` ولها سرعة زاويّة :math:`\omega` حيث :math:`\omega = \dot{\varphi}`. ولكل كتلة قصوريّة ، يمكن التعبير عن اتزان عزم الدوران للكتلة القصوريّة كما يلي:
es: Por ahora, sin embargo, nos centraremos en cómo expresar las ecuaciones asociadas a este simple sistema mecánico. Cada inercia tiene una posición angular, :math:`\varphi`, una velocidad angular, :math:`\omega` donde :math:`\omega = \dot{\varphi}`. Por cada inercia su balance de momentos angulares puede expresarse como:

source: In other words, the sum of the torques, :math:`\tau`, applied to the inertia should be equal to the product of the moment of inertia, :math:`J`, and the angular acceleration, :math:`\dot{\omega}`.
ar: وبعبارة أخرى، فإن مجموع العزوم، :math:`\tau` المؤثرة على الكتلة القصورية يجب أن تساوي حاصل ضرب عزم القصور الذاتي للكتلة :math:`J` والتسارع الزاوي (العجلة الزاويّة) :math:`\dot{\omega}`.
es: En otras palabras, la suma de momentos, :math:`\tau`, aplicada a la inercia debe ser igual al producto del momento de inercia, :math:`J`, y la aceleración angular, :math:`\dot{\omega}`.

source: At this point, all we are missing are the torque values, :math:`\tau_i`. From the previous figure, we can see that there are two springs and two dampers. For the springs, we can use Hooke's law to express the relationship between torque and angular displacement as follows:
ar: عند هذه النقطة، كل ما ينقصنا هو قيم العزوم :math:`\tau_i`. ومن الشكل السابق، يمكننا أن نرى أن هناك زنبَرَكين ومخمّدين. بالنسبة للزنبَرَكين، يمكننا استخدام قانون هوك Hooke's law للتعبير عن العلاقة بين عزم الدوران والإزاحة الزاويّة كما يلي:
es: En este punto, todo lo que nos falta son los valores de los pares, :math:`\tau_i`. En la figura anterior, podemos ver que hay dos muelles y dos amortiguadores. Para los muelles, podemos usar la ley de Hooke para expresar la relación entre el par y el desplazamiento angular de la siguiente manera:

source: For each damper, we express the relationship between torque and relative angular velocity as:
ar: لكل مخمّد، يمكننا التعبير عن العلاقة بين العزم والسرعة الزاويّة النسبيّة كما يلي:
es: Para cada amortiguador, expresamos la relación ente el par y la velocidad angular relativa como:

source: If we pull together all of these relations, we get the following system of equations:
ar: إذا قمنا بسحب كل تلك العلاقات مع بعضها البعض، فسوف يكون لدينا هذه المنظومة من المعادلات:
es: Si unimos todas estas relaciones, obtenemos el siguiente sistema de ecuaciones:

source: Let's assume our system has the following initial conditions as well:
ar: دعونا نفترض أن نظامنا له هذه المعادلات الابتدائية كذلك:
es: Asumamos también que nuestro sistema tiene las siguientes condiciones iniciales:

source: These initial conditions essentially mean that the system starts in a state where neither inertia is actually moving (*i.e.*, :math:`\omega=0`), but there is a non-zero deflection across both springs.
ar: هذه الظروف الابتدائية تعني أساسا أن النظام يبدأ في حالة حيث لا تتحرك أي من الكتلة القصوريّة الأولى أو الثانية (*أي أن:* :math:`\omega=0`) ولكن هناك انحرافا لا يساوي الصفر بين كلا الزنبَرَكين.
es: Estas condiciones iniciales significan esencialmente que el sistema empieza en un estado en el que ninguna de las inercias se está moviento realmente (*es decir*, :math:`\omega=0`), pero hay una deformación distinta de cero en los dos muelles.

source: Pulling all of these variables and equations together, we can express this problem in Modelica as follows:
ar: وبسحب كل هذه المتغيرات والمعادلات معا، يمكننا التعبير عن المسألة بلغة مودليكا كالتالي:
es: Uniendo todas estas variables y ecuaciones juntas, podemos expresar este problema en Modelica de la siguiente manera:

source: As we did with the low-pass filter example, ``RLC1``, let's walk through this line by line.
ar: وكما فعلنا في مثال مرشّح تمرير الترددات المنخفضة ``RLC1`` هيا بنا نسير خلال هذا المثال سطرا سطرا.
es: Como hicimos con el ejemplo del filtro pasa bajo, ``RLC1``, vamos a recorrerlo linea a linea.

source: As usual, we start with the name of the model:
ar: وكالمعتاد، نبدأ باسم النموذج:
es: Como de costumbre, comenzamos con el nombre del modelo:

source: Next, we introduce physical types for a rotational mechanical system, namely:
ar: وبعدها نقدّم الأنواع الفيزيائية الخاصة بنظام ميكانيكي دوراني، والمسماة:
es: A continuación, introducimos tipos físicos para un sistema mecánico rotacional, a saber:

source: Then we define the various parameters used to represent the different physical characteristics of our system:
ar: وبعدها نقوم بتعريف المعاملات المختلفة المستخدمة للتعبير عن الخواص الفيزيائية في نظامنا:
es: Despues definimos los diversos parámetros usados para representar las diferentes características físicas de nuestro sistema:

source: For this system, there are four non-``parameter`` variables. These are defined as follows:
ar: ولهذا النظام، هناك أربعة متغيرات لا تمثل معاملات. ويمكن تعريفها كما يلي:
es: Para este sistema, hay cuatro variables que no son ``parameter``. Estas se definen de la siguiente manera:

source: The initial conditions (which we will revisit shortly) are then defined with:
ar: الظروف الابتدائية (التي سوف نعود لزيارتها قريبا) يمكن تعريفها هكذا:
es: Las condiciones iniciales (que vamos a revisar en breve) se definen con:

source: Then come the equations describing the dynamic response of our system:
ar: وبعدها تأتي المعادلات التي تصف الاستجابة الديناميكية لنظامنا:
es: Luego vienen las ecuaciones que describen la respuesta dinámica de nuestro sistema:

source: And finally, we have the closing of our model definition.
ar: وفي النهاية، لدينا إغلاق هذا التعريف لنموذجنا.
es: Y finalmente, tenemos el cierre de la definición de nuestro modelo.

source: The only drawback of this model is that all of our initial conditions have been "hard-coded" into the model. This means that we will be unable to specify any alternative set of initial conditions for this model. We can overcome this issue, as we did with our :ref:`Newton cooling examples <getting-physical>`, by defining ``parameter`` variables to represent the initial conditions as follows:
ar: العيب الوحيد لهذا النموذج هو أن كل الظروف الابتدائية تمت كتابتها بصعوبة في الكود البرمجي للنموذج. وهذا يعني أننا لن نكون قادرين على تحديد أي مجموعة بديلة من الظروف الابتدائية في هذا النموذج. ويمكننا التغلب على هذه المشكلة كما فعلنا في المثال السابق :ref:`Newton cooling examples <getting-physical>` عن طريق تعريف متغيرات المعاملات التي تصف الظروف الابتدائية كما يلي:
es: El único inconveniente de este modelo es que todas nuestras condiciones iniciales se han "incrustado directamente" en el modelo. Esto significa que no seremos capaces de especificar un conjunto alternativo de condiciones iniciales para este modelo. Podemos salvar esta cuestión, como hicimos con nuestros :ref:`Newton cooling examples <getting-physical>`, definiendo variables ``parameter`` para representar las condiciones iniciales de la siguiente manera:

source: In this way, the parameter values can be changed either in the simulation environment (where parameters are typically editable by the user) or, as we will see shortly, via so-called "modifications".
ar: وبهذه الطريقة، قيم المعاملات يمكن تغييرها سواء من خلال البيئة البرمجية للمحاكاة (والتي يكون فيها المعاملات قابلة للتعديل عادة عن طريق المستخدم) أو كما سنرى قريبا عن طريق ما يسمى التعديلات "modifications".
es: De esta manera, los valores de los parámetros pueden modificarse o bien en el entorno de simulación (donde típicamente los parámetros son editables por el usuario) o, como veremos en breve, a través de las llamadas "modificaciones".

source: You will see in this latest version of the model that the values for the newly introduced parameters are the same as the hard-coded values used earlier. As a result, the default initial conditions will be exactly the same as they were before. But now, we have the freedom to explore other initial conditions as well. For example, if we simulate the ``SecondOrderSystemInitParams`` model as is, we get the following solution for the angular positions and velocities:
ar: سترى في النسخة الأحدث من النموذج أن قيم المعاملات التي تم تقديمها منذ قليل هي نفس القيم التي كنا نكتب الكود البرمجي لها بصعوبة سابقا. وكنتيجة لذلك، الظروف الابتدائية الافتراضية سوف تكون لها نفس القيم السابقة بالضبط ولكن، لدينا الحرية لاستكشاف ظروف ابتدائية أخرى أيضا. فمثلا، إذا قمنا بمحاكاة النموذج ``SecondOrderSystemInitParams`` كما هو، سيكون لدينا الحل التالي للمواضع الزاويّة والسرعات الزاويّة:
es: Vereis en esta última versión del modelo que los valores de los parámetros recien introducidos son los mismos que los valores incrustados utilizados anteriormente. Como resultado, las condiciones iniciales por defecto serán exactamente las mismas que eran antes. Pero ahora, tenemos la libertad de explorar también otras condiciones iniciales. Por ejemplo, si simulamos el modelo `SecondOrderSystemInitParams`` tal como es, obtenemos la siguiente solución para las posiciones y velocidades angulares:

source: However, if we modify the ``phi1_init`` parameter to be *1* at the start of our simulation, we get this solution instead:
ar: ولكن، إذا قمنا بتعديل المعامل ``phi1_init`` ليصبح *1* في بداية المحاكاة ، سيكون لدينا هذا الحل بدلا عن الحل السابق:

source: Expanding on this mechanical example
ar: المزيد عن هذا المثال الميكانيكي
es: Ampliando este ejemplo mecánico

source: If you would like to see this example further developed, you may wish to jump to the set of examples involving rotational systems found in the section on :ref:`speed-measurement`.
ar: إذا كنت تحب أن ترى المزيد عن تطوير مثل هذا المثال، قد ترغب في القفز إلى مجموعة من الأمثلة التي تتضمن أنظمة دورانية والتي تجدها في قسم قياس السرعة :ref:`speed-measurement`.
es: Si se quiere ver este ejemplo más desarrollado, es posible que desee saltar al conjunto de ejemplos que incluyen sistemas rotacionales que se encuentran en la sección :ref:`speed-measurement`.

source: Otherwise, you can continue to the next set of examples which involve population dynamics.
ar: وأما إذا لم ترغب، فيمكنك الاستمرار في القراءة لتصل إلى المجموعة القادمة من الأمثلة والتي تتضمن الحديث عن الديناميكا السكّانية البيئية. -Used Terms المصطلحات المستخدمة- mechanical ميكانيكي schematic رسم تخطيطي graphical representation تمثيل رسومي set مجموعة inertia قصور ذاتي ، عطالة inertia كتلة قصوريَّة (لها عزم قصور ذاتي) mass moment of inertia عزم القصور الذاتي للكتلة (للدوران) torque عزم دوران angle زاوية angular acceleration التسارع الزاوي (العجلة الزاويّة) angular velocity السرعة الزاويّة (مقياس لسرعة الدوران) relative angular velovity السرعة الزاويّة النسبيّة السرعة الزاويّة النسبيّة تساوي الفرق بين سرعتين زاويّتين angular position الموضع الزاوي angular displacement الإزاحة الزاويّة الإزاحة الزاويّة تساوي الفرق بين موضعين زاويّين spring زنبَرَك زنبَرَك للنظام الدوراني وزنبُرُك للنظام الانتقالي damper مخمّد population dynamics الديناميكا السكّانية البيئية
es: De lo contrario, puede continuar con el siguiente conjunto de ejemplos que involucran la dinámica poblacional.

source: Hooke's law
ar: قانون هوك
es: Ley de Hooke

source: modifications
ar: التعديلات
es: modificaciones

source: However, if modify the ``phi1_init`` parameter to be *1* at the start of our simulation, we get this solution instead:
es: Sin embargo, si modificamos el parámetro ``phi1_init`` para que sea *1* al inicio de nuestra simulación, obtenemos esta solución:
