Repository: Claire-Eleutheriane/educational_book
Catalog: ModelicaBook/text/locale/*/LC_MESSAGES/behavior/equations/physical.po
Languages: ar, es

source: From this example, we can see that once we define a physical type like ``Temperature``, we can use it to declare multiple variables (*e.g.*, ``T``, ``T_inf`` and ``T0``) without having to specify the ``unit`` or ``min`` attribute for each variable. Also, we get to use the familiar name ``Temperature`` instead of the SI unit, ``K``. You might be wondering what other attributes are available when creating derived types. For further discussion, see the section on :ref:`builtin-types`.
ar: من هذا المثال، يمكننا أن نرى انه بمجرد تعريف نوع فيزيائي مثل درجة الحرارة ``Temperature`` يمكننا استخدام هذا النوع للإعلان عن العديد من المتغيرات (*مثل:* ``T`` و ``T_inf`` و ``T0`` بدون الحاجة إلى تحديد تمييز الوحدة الفيزيائية أو القيمة الصغرى ``unit`` أو ``min`` لكل متغيّر. وأيضا لدينا الآن اسم مألوف هو درجة حرارة ``Temperature`` بدلا من من الوحدة القياسية الدولية ``K``. قد تتساءل عن التمييزات الأخرى المتاحة عند نشاء الأنواع المشتقة. للمزيد من المناقشات حول هذا الموضوع يكنك الاتجاه إلى قسم الأنواع المُضَمَّنة (الأنواع المبنية ضمن لغة مودليكا) :ref:`builtin-types`.
es: En este ejemplo, podemos ver que una vez que definimos un tipo físico como ``Temperature``, podemos usarlo para declarar multiples variables (*p.ej.*, ``T``, ``T_inf`` y ``T0``) sin tener que especificar los atributos ``unit`` o ``min`` para cada variable. Además, podemos utilizar el nombre familiar ``Temperature`` en lugar de la unidad del SI, ``K``. Quizá os esteis preguntando qué otros atributos están disponibles cuando se crean tipos derivados. Para más detalles, ver la sección sobre :ref:`builtin-types`.

source: At this point, you might find the idea of defining ``Temperature``, ``ConvectionCoefficient``, ``SpecificHeat`` and ``Mass`` in every model extremely tedious. It would be, if it were truly necessary. But don't worry, there is an easy solution to this as you will see in a later section where we discuss :ref:`importing_physical_types`.
ar: عند هذه النقطة، قد تجد أن فكرة تعريف درجة الحرارة ومعامل الحمل الحراري والسعة الحرارية والكتلة ``Temperature`` و ``ConvectionCoefficient`` و ``SpecificHeat`` و ``Mass`` في كل نموذج عملية شاقة للغاية. وقد تكون كذلك فعلا إذا كانت ضرورية ولازمة. ولكن لا تقلق، فهناك حل بسيط لهذا كما كما سنرى لاحقا في مناقشة قسم استيراد الأنواع الفيزيائية :ref:`importing_physical_types`. -Used Terms المصطلحات المستخدمة- qualifier مميّز (لاحظ الفرق بينها وبين تمييز) attribute تمييز section قسم expression تعبير رياضي physical فيزيائي ، مادي declare إعلان ، تعريف keyword كلمة مفتاحيّة variable متغير specifications مواصفات specification توصيف standard SI Unit attributes تمييزات الوحدات القياسية الدولية complex units وحدات مركّبة built-in types الأنواع المُضمَّنة (الأنواع المبنية ضمن لغة مودليكا) unknown مجهول importing استيراد coefficient مُعامل
es: En este punto, puede que encontreis la idea de definir ``Temperature``, ``ConvectionCoefficient``, ``SpecificHeat`` y ``Mass`` en cada modelo extremadamente tedioso. Lo sería, si realmente fuera necesario. Pero no hay que preocuparse, hay una solución fácil para esto como vereis en una sección posterior donde trataremos sobre :ref:`importing_physical_types`.

source: parameter
ar: مُعامل
es: parametro

source: attributes
ar: تمييزات
es: atributos

source: unit attribute
ar: تمييز الوحدة
es: atributo unit

source: derived types
ar: أنواع مشتقة
es: tipos derivados

source: min attribute
ar: تمييز القيمة الصغرى
es: atributo min

source: type
ar: نوع
es: tipo
