Repository: Claire-Eleutheriane/educational_book
Catalog: ModelicaBook/text/locale/*/LC_MESSAGES/behavior/equations/physical.po
Languages: ar, es

source: Getting Physical
ar: التحوّل إلى النظام المادي
es: Llegando a la física

source: Although the previous section got us started with representing mathematical behavior, it doesn't convey any connection to *physical* behavior. In this section, we'll explore how to build models that represent the modeling of physical behavior. Along the way, we will highlight some of the language features we can leverage that will not only tie these models to physical and engineering domains, but, as we shall see, they can even help us avoid mistakes.
ar: على الرغم من أن القسم السابق قد أخذنا في البداية مع تمثيل السلوك الرياضي، إلا أنه لم يكن له أي صلة بالسلوك المادي. وفي هذا القسم، سوف نستكشف كيفية بناء نماذج تمثل سلوك النظام المادي. وعلى طول الطريق، سوف نسلط الضوء على بعض مميزات لغة مودليكا والتي يمكننا الاستفادة منها ليس فقط من أجل ربط النماذج بالنظام المادي والمجالات الهندسية ولكن أيضا من أجل تجنب الأخطاء.
es: Aunque en la sección anterior comenzamos representando comportamiento matemático, no contiene ninguna conexión con el comportamiento *físico*. En esta sección, exploraremos cómo construir modelos que representan el modelado del comportamiento físico. A lo largo del camino, destacaremos algunas características del lenguaje aprovechando que no solamente unirán estos modelos a los dominios físicos y de la ingeniería, sino, como veremos, incluso pueden ayudarnos a evitar errores.

source: Let's start with the following example:
ar: دعونا نبدأ بهذا المثال
es: Comencemos con el siguiente ejemplo:

source: As we saw in the examples in our discussion of :ref:`first-order`, the previous example consists of a ``model`` definition that includes variables and equations.
ar: كما رأينا في مناقشتنا السابقة عن نظام الرتبة الأولى :ref:`first-order` فالمثال السابق يتكون من تعريف نموذج ``model`` وهو الذي يتضمن المتغيّرات والمعادلات.
es: Como vimos en los ejemplos en nuestra discusión de :ref:`first-order`, el ejemplo anterior consiste en la definición de un ``model`` que incluye variables y ecuaciones.

source: However, this time we see the word ``parameter`` for the first time. Generally speaking, the ``parameter`` keyword is used to indicate variables whose value is known *a priori* (*i.e.*, prior to the simulation). More precisely, ``parameter`` is a keyword that specifies the *variability* of a variable. This will be discussed more thoroughly in the section on :ref:`variability`. But for now, we can think of a ``parameter`` as a variable whose value we must provide.
ar: ولكن هذه المرة سوف نرى كلمة مُعامِل ``parameter`` للمرة الأولى. وبشكل عام، كلمة مُعامِل تستخدم لتعبر عن المتغيّرات التي يطلق عليها ماقبلية *priori* (*أي:* ما قبل المحاكاة). وبصورة أدق فإن كلمة مُعامِل ``parameter`` هي كلمة مفتاحية تحدد مدى تغير المتغير. وسوف نناقش هذا الموضوع بصورة أكبر في قسم التغيّر :ref:`variability`. ولكن الآن ، سوف نعتبر أن المُعامِل هو متغير يجب علينا تحديد قيمته.
es: Sin embargo, en esta ocasión vemos la palabra ``parameter`` por primera vez. En términos generales, la palabra clave ``parameter`` se usa para indicar variables cuyo valor es conocido *a priori* (*es decir*, antes de la simulación). Más concretamente, ``parameter`` es una palabra clave que especifica la *variabilidad* de una variable. Esto se tratará con más detalle en la sección sobre :ref:`variability`. Pero por ahora, podemos pensar en un ``parameter`` como una variable cuyo valor debemos proporcionar.

source: Looking at our ``NewtonCooling`` example, we see there are five parameters: ``T_inf``, ``T0``, ``h``, ``A``, ``m`` and ``c_p``. We don't need to bother explaining what these variables are because the model itself includes a descriptive string for each one. At the moment, there are no values for these parameters, but we will return to that topic shortly. As with all the variables we have seen so far, these are all of type ``Real``.
ar: بالنظر إلى مثالنا ``NewtonCooling`` نرى أن لدينا خمسة معاملات هم: ``T_inf`` و ``T0`` و ``h`` و ``A`` و ``m`` بالإضافة إلى ``c_p``. ونحن لا نحتاج إلى شرح ماهية هذه المتغيرات لأن النموذج نفسه به سلسلة محارف وصفية (مَقْطَع وصفي) لكل واحد منها. في هذه اللحظة، لا توجد قيم لهذه المُعَامِلات، ولكننا سوف نرجع إلى هذا الموضوع قريبا. وكما جميع المتغيرات التي تعاملنا معها حتى الآن، فإن كل المتغيرات ستكون من نوع العدد الحقيقي ``Real``.
es: Mirando a nuestro ejemplo ``NewtonCooling``, vemos que hay cinco parametros: ``T_inf``, ``T0``, ``h``, ``A``, ``m`` y ``c_p``. No necesitamos preocuparnos de explicar qué son estas variables porque el modelo mismo incluye un string descriptivo para cada una. Por el momento, no hay valores para estos parámetros, pero volveremos a este tema en breve. Como todas las variables que hemos visto hasta ahora, estas son todas del tipo ``Real``.

source: Let's examine the rest of this model. The next variable is ``T`` (also a ``Real``). Since this variable doesn't have the ``parameter`` qualifier, its value is determined by the equations in the model.
ar: دعونا نجرب بقية هذا النموذج. المتغير التالي هو ``T`` (وهو أيضا من نوع العدد الحقيقي ``Real``). ولأن هذا المتغير ليس له مميِّز يبين أنه مُعَامِل ``parameter`` فإن قيمته ستتحدد عن طريق المعادلات في النموذج.
es: Examinemos el resto de este modelo. La siguiente variable es ``T`` (también ``Real``). Como esta variable no tiene el calificativo ``parameter``, su valor es determinado por las ecuaciones del modelo.

source: Next we see the two ``equation`` sections. The first is an ``initial equation`` section which specifies how the variable ``T`` should be initialized. It should be pretty clear that the initial value for ``T`` is going to be whatever value was given (by us) for the parameter ``T0``.
ar: دعونا ننظر إلى قسمي المعادلة. القسم الأول هو معادلة الابتداء ``initial equation`` والذي يحدد كيفية ابتداء المتغير ``T``. يجب أن يكون واضحا أن القيمة الابتدائية ل ``T`` ستحدد قيمتها حسب القيمة التي ستعطى للمعامل (عن طريقنا) ``T0``.
es: Despues vemos las dos secciones ``equation``. La primera es una sección ``initial equation`` que especifica cómo debe ser inicializada la variable ``T``. Debe quedar muy claro que el valor inicial para ``T`` va a ser cualquier valor asignado (por nosotros) al parámetro ``T0``.

source: The other equation is the differential equation that governs the behavior of ``T``. Mathematically, we could express this equation as:
ar: والمعادلة الأخرى هي المعادلة التفاضلية التي ستحدد السلوك لـ ``T``. ورياضيا يمكن تمثيل هذه المعادلة كالتالي:
es: La otra ecuación es la ecuación diferencial que gobierna el comportamiento de ``T``. Matemáticamente, podemos expresar esta ecuación como:

source: but in Modelica, we write it as:
ar: ولكن في لغة مودليكا، نحن نكتبها على الصورة التالية:
es: pero en Modelica, la escribimos como:

source: Note that this is really no different from the equation we saw in our ``FirstOrder`` model from the :ref:`first-order` example.
ar: لاحظ أنه لا يوجد هنا اختلاف حقيقي عن المعادلة التي رأيناها في نموذج نظام الرتبة الأولى ``FirstOrder`` في المثال الذي ذكرناه في قسم نظام بسيط من الرتبة الأولى :ref:`first-order`
es: Observa que ésta realmente no es diferente de la ecuación que vimos en nuestro modelo ``FirstOrder`` del ejemplo :ref:`first-order`.

source: One thing worth noting is that the equation in our ``NewtonCooling`` example contains an **expression** on the left hand side. In Modelica, it is **not** necessary for each equation to be an explicit equation for a single variable. An equation can contain arbitrary expressions on either side of the equals sign. It is the compiler's job to determine how to use these equations to solve for the variables contained in the equations.
ar: أحد الأمور التي ليس بها أية مشكلة هو أن المعادلة في مثالنا ``NewtonCooling`` تتضمن **تعبيرا رياضيا** في الطرف الأيسر من المعادلة. في لغة مودليكا **ليس** ضروريا أن تكون كل معادلة هي معادلة صريحة لمتغير واحد. أية معادلة قد تتضمن تعبيرات رياضية في أي طرف من طرفي المعادلة حول علامة التساوي. ومهمة المُصَرِّف (المترجم) هي تحديد كيفية استخدام هذه المعادلات لإيجاد الحل للمتغيرات التي توجد في هذه المعادلات.
es: Una cosa que merece ser mencionada es que la ecuación en nuestro ejemplo ``NewtonCooling`` contiene una **expresión** en el lado izquierdo. En Modelica, **no** es necesario que cada ecuación sea una ecuación explícita para una única variable. Una ecuación puede contener expresiones arbitrarias en cualquier lado del signo de igualdad. Es trabajo del compilador determinar cómo usar estas ecuaciones para resolver las variables contenidas en ellas.

source: Another thing that distinguishes our ``NewtonCooling`` example from the ``FirstOrder`` model is that we can independently adjust the different parameter values. Furthermore, these parameter values are tied to physical, measurable properties of the materials or environmental conditions. In other words, this version is slightly more physical than the simple mathematical relationship used in the ``FirstOrder`` model because it is related to physical properties.
ar: وشيء آخر يميز مثالنا ``NewtonCooling`` عن نموذج ``FirstOrder`` وهو أننا نستطيع بشكل مستقل ضبط القيم المختلفة للمعاملات. وعلاوة على ذلك، فإن قيم هذه المعاملات مرتبطة بخواص مادية يمكن قياسها للمواد أو لظروف البيئة. وبعبارة أخرى، فإن هذا المثال مادي أكثر وليس مجموعة من العلاقات الرياضية البسيطة كما هو الحال في نموذج ``FirstOrder`` وذلك لأنه متعلق بالخواص المادية.
es: Otra cosa que distingue nuestro ejemplo ``NewtonCooling`` del modelo ``FirstOrder`` es que podemos ajustar independientemente los diferentes valores de los parámetros. Además, estos parámetros están unidos a propiedades físicas medibles de los materiales o de las condiciones ambientales. En otras palabras, esta versión es ligeramente más física que la simple relación matemática usada en el modelo ``FirstOrder`` porque está relacionada con propiedades físicas.

source: Now, we can't really run the ``NewtonCooling`` model as is because it lacks *values* for the six parameters. In order to create a model that is ready to be simulated, we need to provide those values, *e.g.*,
ar: الآن، نحن لا نستطيع بالفعل تشغيل نموذج ``NewtonCooling`` كما هو ﻷنه ما زالت تنقصه *قيم* المعاملات الستة. ومن أجل عمل نموذج جاهز للمحاكاة، يجب أن تكون هذه القيم معطاه، *وعلى سبيل المثال،*
es: Ahora, no podemos ejecutar el modelo ``NewtonCooling`` tal como es porque le faltan *valores* para los seis parámetros. Para crear un modelo que esté listo para ser simulado, necesitamos proporcionar esos valores, *p.ej.*,

source: The only real difference here is that each of the ``parameter`` variables now has a value specified. One way to think about the ``NewtonCooling`` model is that we could not simulate it because it had 7 variables (total) and only one equation (see the section on :ref:`initialization` for an explanation of why the ``initial equation`` doesn't really count). However, the ``NewtonCoolingWithDefaults`` model has, conceptually speaking, 7 equations (6 of them coming from specifying the values of the ``parameter`` variables + one in the equation section) and 7 unknowns.
ar: الفرق الحقيقي الوحيد الذي حدث هنا هو أن كل معامل الآن له قيمة محددة. أحد الطرق للتفكير في نموذج ``NewtonCooling`` هي عندما نقول إننا لا نستطيع عمل محاكاة له ﻷنه يتضمن سبعة متغيرات (ككل) ومعادلة واحدة فقط (انظر في قسم الابتداء :ref:`initialization` لتوضيح السبب الذي من أجله لا نَعُدّ معادلة الابتداء). ولكن نموذج ``NewtonCoolingWithDefaults`` يحتوي بشكل نظري على سبعة معادلات -ستة منها تأتي من تحديد قيم متغيرات المعاملات وواحد في قسم المعادلة- وسبعة مجاهيل.
es: La única diferencia real aquí es que cada una de las variables ``parameter`` ahora tiene un valor especificado. Una manera de pensar sobre el modelo ``NewtonCooling`` es que no podíamos simularlo porque tenía 7 variables (en total) y una única ecuación ( ver la sección :ref:`initialization` para una explicación sobre porque la ``initial equation`` no cuenta). Sin embargo, el modelo ``NewtonCoolingWithDefaults`` tiene, conceptualmente, 7 ecuaciones (6 de ellas provienen de especificar los valores de las variables

source: If we simulate the ``NewtonCoolingWithDefaults`` model, we get the following solution for ``T``.
ar: إذا قمنا بمحاكاة نموذج ``NewtonCoolingWithDefaults`` سنحصل على الحل التالي ل ``T``.
es: Si simulamos el modelo ``NewtonCoolingWithDefaults``, obtenemos la siguiente solución para ``T``.

source: Physical Units
ar: الوحدات الفيزيائية
es: Unidades físicas

source: As mentioned already in this section, these examples are a bit more physical because they include individual physical parameters that correspond to individual properties of our real world system. However, we are still missing something. Although these variables represent physical quantities like temperature, mass, *etc.*, we haven't explicitly given them any physical types.
ar: كما ذكرنا للتو في هذا القسم، هذه الأمثلة أصبحت مادية أكثر لأنها تحتوي على معاملات فيزيائية مستقلة تعبر عن خواص في نظامنا في العالم الحقيقي. ولكن، ما زلنا نفتقد شيئا ما. فبالرغم من أن هذه المتغيرات تعبر عن كميات فيزيائية مثل درجة الحرارة، والكتلة ..إلخ، إلا أننا لم نذكر نوع كل منها صراحة.
es: Como se ha mencionado ya en esta sección, estos ejemplos son un poco más físicos porque incluyen parámetros físicos individuales que se corresponden con propiedades individuales de nuestro sistema del mundo real. Sin embargo, todavía nos falta algo. Aunque estas variables representan cantidades físicas como temperatura, masa, *etc.*, no les hemos asignado explicitamente ningún tipo físico.

source: As you may have already guessed, the variable ``T`` is a temperature. This is made clear in the descriptive text associated with the variable. Furthermore, it doesn't take a very deep analysis of our previous model to determine that ``T0`` and ``T_inf`` must also be temperatures.
ar: وكما توقعتا للتو، المتغير ``T`` هو درجة حرارة. هذا واضح في النص الوصفي المصاحب للمتغير. بالإضافة إلى ذلك، لم يتم إجراء تحليل عميق جدا في النموذج السابق لتحديد أن كلا من ``T0`` و ``T_inf`` يجب أن يكونا أيضا درجات حرارة.
es: Como ya habreis imaginado, la variable ``T`` es una temperatura. Esto queda claro en el texto descriptivo asociado con la variable. Además, no se requiere un análisis profundo de nuestro modelo anterior para determinar que ``T0`` y ``T_inf`` deben ser también temperaturas.

source: But what about the other variables like ``h`` or ``A``? What do they represent? Even more important, are the equations **physically consistent**? By physically consistent, we mean that both sides of the equations have the same physical units (*e.g.*, temperature, mass, power).
ar: ولكن ماذا عن متغيرات أخرى مثل ``h`` أو ``A``؟ عن ماذا يعبران؟ والأكثر أهمية هو هل هذه المعادلات متفقة مع بعضها من الناحية الفيزيائية؟ والاتفاق من الناحية الفيزيائية معناه هل الوحدات في كلا الطرفين في المعادلات هي نفسها (كدرجة الحرارة أو الكتلة أو القدرة *مثلا*).
es: Pero ¿que pasa con las otras variables como ``h`` y ``A``? ¿Qué representan? Aun más importante, ¿las ecuaciones son **consistentes físicamente**? Por consistentes físicamente, queremos decir que ambos lados de las ecuaciones tengan las mismas unidades físicas (*p.ej.*, temperatura, masa, potencia).

source: We could convey the physical units of the different variables more rigorously by actually including them in the variable declarations, like so:
ar: يمكننا التعامل مع الوحدات الفيزيائية للمتغيرات المختلفة بدقة وذلك بجعلها ضمن إعلان المتغيرات كالتالي:
es: Podemos representar las unidades físicas de las diferentes variables de forma más rigurosa incluyéndolas en las declaraciones de las variables, como:

source: Note that each of the variable declarations now includes the text ``(unit="...")`` to associate a physical unit with the variable. What this additional text does is specify a value for the ``unit`` attribute associated with the variable. Attributes are special properties that each variable has. The set of attributes a variable can have depends on the type of the variable (this is discussed in more detail in the upcoming section on :ref:`variables`).
ar: لاحظ أن إعلانات المتغيرات الآن أصبحت تحوي هذه العبارة ``(unit="...")`` وذلك لكتابة الوحدة الفيزيائية مع المتغير. وما يبينه هذا النص هو تحديد قيمة لتمييز الوحدة الفيزيائية المرتبطة بهذا المتغير. والتمييزات هي خواص مميزة تميّز كل متغير. ومجموعة التمييزات التي يرتبط بها كل متغير تعتمد على نوع هذا المتغير (وهذا الموضوع ستتم مناقشته بالتفصيل في قسم المتغيرات لاحقا :ref:`variables`).
es: Observa que ahora las declaraciones de las variables incluyen el texto ``(unit="...")`` para asociar una unidad física con la variable. Lo que hace este texto adicional es especificar un valor para el atributo ``unit`` asociado con la variable. Los atributos son propiedades especiales que tiene cada variable. El conjunto de atributos que una variable puede tener depende del tipo de variable (esto se trara en más detalle en la siguiente sección sobre :ref:`variables`).

source: At first glance, it may not seem obvious why specifying the unit attribute (*e.g.*, ``(unit="K")``) is any better than simply adding ``"Temperature"`` to the descriptive string following the variable. In fact, one might even argue it is worse because "Temperature" is more descriptive than just a single letter like "K".
ar: للوهلة الأولى، قد لا يبدو واضحا السبب الذي من أجله نقوم بتحديد تمييز للوحدة *مثل هذا:* ``(unit="K")`` ولماذا لا نقوم ببساطة بكتابة درجة حرارة Temperature ومن ثم نضيفها إلى سلسلة المحارف الوصفية (المَقْطَع الوصفي) التي تتبع المتغير. في الحقيقة، قد يجادل البعض ويقولون إن هذا أسوأ ﻷن كلمة درجة حرارة تعتبر واصفة بشكل أفضل من مجرد حرف مثل: "K".
es: En un primer vistazo, puede no parecer obvio porque especificar el atributo unit (*e.g.*, ``(unit="K")``) es mejor que simplemente añadir ``"Temperature"`` al texto descriptivo que sigue a la variable. De hecho, uno puede argumentar que es incluso peor porque "Temperature" es más descriptivo que una simple letra como "K".

source: However, setting the ``unit`` attribute is actually a more formal approach for two reasons. The first reason is that the Modelica specification defines relationships for all the standard SI unit attributes (*e.g.*, ``K``, ``kg``, ``m``). This includes complex unit types that can be composed of other base units (*e.g.*, ``N``).
ar: ولكن في الحقيقة ضبط تمييز الوحدة هو الأفضل لسببين. الأول هو أن مواصفات لغة مودليكا تعرّف العلاقات بين تمييزات الوحدات القياسية في النظام الدولي SI Units *وذلك مثل:* ``K`` و ``kg`` و ``m``. وذلك يتضمن الوحدات المركّبة *مثل:* ``N``.
es: Sin embargo, definir el atributo ``unit`` es realmente una aproximación más formal por dos razones. La primera razon es que la especificación de Modelica define relaciones para todos los atributos de las unidades estandar del SI (*p.ej.*, ``K``, ``kg``, ``m``). Esto incluye tipos de unidades complejos que pueden componerse con otras unidades base (*p.ej.*, ``N``).

source: The other reason is that the Modelica specification also defines rules for how to compute the units of complex mathematical expressions. In this way, the Modelica specification defines everything that is necessary to **unit check** Modelica models for errors or physical inconsistencies. This is a big win for model developers because adding units not only makes the models clearer, it provides better diagnostics in the case of errors.
ar: والسبب الآخر هو أن مواصفات لغة مودليكا تعرّف أيضا القوانين والتعبيرات الرياضية التي تبيّن كيفية حساب الوحدات المركّبة. وبهذه الطريقة تعرّف مواصفات لغة مودليكا كل ما هو مطلوب لاختبار الوحدات في نماذج مودليكا واكتشاف الأخطاء أو عدم اتساق الوحدات الفيزيائية مع بعضها. وهذا يعتبر ميزة كبيرة لمطوّري النماذج لأن إضافة الوحدات لا تجعل النماذج أوضح وحسب ولكنها أيضا تجعل اكتشاف الأخطاء اكثر سهولة.
es: La otra razón es que la especificación de Modelica también define las normas sobre cómo computar las unidades de expresiones matemáticas complejas. De esta manera, la especificación de Modelica define todo lo necesario para hacer una **verificación de unidades* de los modelos de Modelica para identificar errores o inconsistencias físicas. Esto es una gran ventaja para los desarrolladores de modelos porque añadir unidades no solo hace los modelos más claros, sino que proporciona diagnósticos mejores en caso de errores.

source: Physical Types
ar: الأنواع الفيزيائية
es: Tipos físicos

source: But truth be told, there is one drawback of the code for our ``NewtonCoolingWithUnits`` example and that is that we have to repeat the ``unit`` attribute specification for every variable. Furthermore, as mentioned previously, ``K`` isn't nearly as descriptive as "Temperature".
ar: ولكن في الحقيقة ، هناك عيب في الكود البرمجي لمثالنا ``NewtonCoolingWithUnits`` هو أننا نقوم بتكرار ذكر توصيف تمييز ``الوحدة`` لكل متغيّر. بالإضافة إلى ذلك فإن حرف ``K`` كما ذكرنا سابقا هو ليس واصفا كما كلمة درجة حرارة "Temperature".
es: Pero para decir toda la verdad, hay una desventaja del código para nuestro ejemplo ``NewtonCoolingWithUnits`` y ésta es que tenemos que repetir la especificación del atributo ``unit`` para todas las variables. Además, tal como se ha mencionado previamente, ``K`` no es tan descriptivo como "Temperature".

source: Fortunately, we have a simple solution to both problems because Modelica allows us to define *derived types*. So far, all the variables we have declared have been of type ``Real``. The problem with ``Real`` is that it could be anything (*e.g.*, a voltage, a current, a temperature). What we'd like to do is narrow things down a bit. This is where derived types come in. To see how to define derived types and then use them in declarations, consider the following example:
ar: لحسن الحظ، لدينا حل بسيط لكلا المشكلتين لأن لغة مودليكا تتيح لنا تعريف *أنواع مشتقة*. حتى الآن، كل المتغيرات التي عرّفناها كانت من نوع العدد الحقيقي ``Real`` ومشكلة هذا النوع هي أنه قد يكون أي شيء (*مثل:* الجهد الكهربي، والتيار، ودرجة الحرارة). وما نود أن نفعله هو تقريب الأمور قليلا. وذلك لكي نرى كيفية تعريف الأنواع المشتقة، ومن ثم استخدامها في الإعلانات انظر في المثال التالي:
es: Afortunadamente, tenemos una solución simple para ambos problemas porque Modelica nos permite definir *tipos derivados*. Hasta ahora, todas las variables que hemos declarado han sido del tipo ``Real``. El problema con ``Real`` es que puede ser cualquier cosa (*p.ej.*, un voltaje, una corriente, una temperatura). Lo que nos gustaría hacer es facilitar las cosas un poco. Aquí es donde aparecen los tipos derivados. Consideremos el siguiente ejemplo para ver cómo definir tipos derivados y después usarlos en las declaraciones:

source: You can read the definition ``type Temperature=Real(unit="K", min=0);`` as "Let us define a new type, ``Temperature``, that is a specialization of the built-in type ``Real`` with physical units of Kelvin (``K``) and a minimum possible value of ``0``".
ar: يمكنك أن تقرا التعريف ``type Temperature=Real(unit="K", min=0);`` ودعنا نعرّف نوعا جديدا هو درجة حرارة ``Temperature`` وهذا تخصيص للنوع المُضَمَّن (النوع المبني ضمن لغة مودليكا) والمسمى عدد حقيقي ``Real`` وذلك بجعل وحدة قياسه الفيزيائية هي كلفن ``K`` وجعل القيمة الصغرى له تساوي الصفر.
es: Podeis leer la definición ``type Temperature=Real(unit="K", min=0);`` como "Vamos a definir un nuevo tipo, ``Temperature``, que es una especialización de el tipo predefinido ``Real`` con unidades físicas de grados Kelvin (``K``) y un valor mínimo posible de ``0``".
