Repository: Claire-Eleutheriane/educational_book
Catalog: ModelicaBook/text/locale/*/LC_MESSAGES/behavior/equations/population.po
Languages: es

source: In any case, the bottom line is that during initialization we require four different equations to arrive at a unique solution. In the case of our ``QuiescentModel``, those four equations are:
es: En cualquier caso, el resultado final es que durante la inicialización necesitamos cuatro ecuaciones diferentes para llegar a una solución única. En el caso de nuestro `QuiescentModel``, estas cuatro ecuaciones son:

source: It is very important to understand that these equations **do not contradict each other**. Especially if you come from a programming background you might look at the first two equations and think "Well what is :math:`\dot{x}`? Is it zero or is it :math:`x (\alpha - \beta y)`?" The answer is **both**. There is no reason that both equations cannot be true!
es: Es muy importante entender que esas ecuaciones **no se contradicen entre ellas**. Especialmente si tenemos experiencia en programación puede que miremos a las dos primeras ecuaciones y pensemos "Entonces ¿qué es :math:`\dot{x}`? ¿Es cero o es :math:`x (\alpha - \beta y)`?" La respuesa es que **ambas**. ¡No hay razón para que ambas ecuaciones no puedan ser verdad!

source: The essential thing to remember here is that these are **equations not assignment statements**. The following system of equations is mathematically identical and demonstrates more clearly how :math:`x` and :math:`y` could be solved:
es: La ideal esencial a recordar aquí es que estas son **ecuaciones y no sentencias de asignación**. El siguiente sistema de ecuaciones es identico matemáticamente y demuestra más claramente como puede resolverse :math:`x` y :math:`y`:

source: In this form, it is a bit easier to recognize how we could arrive at values of :math:`x` and :math:`y`. The first thing to note is that we cannot solve explicitly for :math:`x` and :math:`y`. In other words, we cannot rearrange these equations into the form :math:`x=...` without having :math:`x` also appear on the right hand side. So we have to deal with the fact that **this is a simultaneous system of equations** involving both :math:`x` and :math:`y`.
es: De esta manera, es un poco más fácil reconocer cómo podemos llegar a los valores de :math:`x` y :math:`y`. La primera cosa a notar es que no podemos resolverexplícitamente :math:`x` y :math:`y`. En otras palabras, no podemos reorganizar estas ecuaciones en la forma :math:`x=...` sin que :math:`x` también aparezca en el lado derecho. Tenemos que lidiar con el hecho de que **este es un sistema de ecuaciones simultáneo** que implica a ambas :math:`x` e :math:`y`.

source: But the situation is further complicated by the fact that this system is non-linear (which is precisely why we cannot use linear algebra to arrive at a set of explicit equations). In fact, if we study these equations carefully we can spot the fact that there exist two potential solutions. One solution is trivial (:math:`x=0;y=0`) and the other is not.
es: Pero la situación se complica más por el hecho de que este sistema es no-lineal (que es precisamente la razon por la que no podemos usar algebra lineal para obtener un conjunto de ecuaciones explícitas). De hecho, si estudiamos estas ecuaciones cuidadosamente podemos detectar el hecho de que existen dos soluciones posibles. Una solución es trivial (:math:`x=0;y=0`) y la otra no lo es.

source: So what happens if we try to simulate our ``QuiescentModel``? The answer is pretty obvious in the plot below:
es: Entonces, ¿qué ocurre si intentamos simular nuestro ``QuiescentModel``? La respuesta es muy obvia en la gráfica siguiente:

source: We ended up with the trivial solution where the prey and predator populations are zero. In this case, we have no reproduction, predation or starvation because all these effects are proportional to the populations (*i.e.*, zero) so nothing changes. But this isn't a very interesting solution.
es: Terminamos con la solución trivial en la que las poblaciones de presas y predadores son cero. En este caso, no tenemos reproducción, predación o inanición porque todos estos efectos son proporcionales a las poblaciones (*es decir*, cero) por lo que nada cambia. Pero esta no es una solución muy interesante.

source: There are two solutions to this system of equations because it is non-linear. How can we steer the non-linear solver away from this trivial solution? If you were paying attention during the discussion of the :ref:`classic-lotka-volterra` model, then you've already been given a hint about the answer.
es: Existen dos soluciones para este sistema de ecuaciones porque es no-lineal. ¿Cómo podemos dirigir al solucionador no-lineal lejos de esta solución trivial? Si estabais prestando atención durante la discusión sobre el modelo :ref:`classic-lotka-volterra`, entonces ya tenéis una pista sobre la respuesta.

source: Recall that the ``start`` attribute is overloaded. During our discussion of the :ref:`classic-lotka-volterra` model, it was pointed out that one of the purposes of the ``start`` attribute was to provide an initial guess if the variable with the ``start`` attribute was chosen as an iteration variable. Well, our ``QuiescentModel`` happens to be a case where ``x`` and ``y`` are, in fact, iteration variables because they must be solved using a system of non-linear equations. This means that if we want to avoid the trivial solution, we need to specify values for the ``start`` attribute on both ``x`` and ``y`` that are "far away" from the trivial solution we are trying to avoid (or at least closer to the non-trivial solution we seek). For example:
es: Hay que recordar que el atributo ``start`` esta sobrecargado. Durante nuestra discusión sobre el modelo :ref:`classic-lotka-volterra`, se indicó que uno de los propósitos del atributo ``start`` era proporcionar una estimación inicial si la variable con el atributo ``start`` se escoge como variable de iteración. Bien, nuestro modelo ``QuiescentModel`` resulta ser un caso donde ``x`` e ``y`` son, de hecho, variables de iteración porque deben resolverse usando un sistema de ecuaciones no-lineales. Esto significa que si queremos evitar la solución trivial, necesitamos especificar valores para el atributo ``start`` en ``x`` e ``y`` que estén "lejos" de la solución trivial que estamos tratando de evitar (o por lo menos más cerca de la solución no trivial que buscamos). Por ejemplo:

source: This model leads us to a set of initial conditions that is more inline with what we were originally looking for (*i.e.*, one with non-zero populations for both the predator and prey species).
es: Este modelo nos lleva a un conjunto de condiciones iniciales que está más en línea con lo que estábamos buscando originalmente (*es decir*, una con poblaciones distintas de cero para ambas especies, predadores y presas).

source: It is worth pointing out (as we will do shortly in the section on :ref:`builtin-types`), that **the default value of the ``start`` attribute is zero**. This is why when we simulated our original ``QuiescentModel`` we happened to land exactly on the trivial solution...because it was our initial guess and it happened to be an exact solution so no other solution or iterating was required.
es: Merece la pena mencionar (como haremos en breve en la sección sobre :ref:`builtin-types`), que **el valor por defecto del atributo ``start`` es cero**. Essta es la razón por la que cuando simulamos nuestro modelo original ``QuiescentModel`` ocurre que obtenemos exactamente la solución trivial... porque era nuestra estimación inicial y sucede que es una solución exacta por lo que no se requiere otra solución o iteración.

source: Avoiding Repetition
es: Evitando repeticiones

source: We've already seen several different models (``ClassicModel``, ``QuiescentModel`` and ``QuiescentModelUsingStart``) based on the Lotka-Volterra equations. Have you noticed something they all have in common? If you look closely, you will see that they have almost **everything** in common and that there are actually hardly any **differences** between them!
es: Hemos visto ya muchos modelos diferentes (``ClassicModel``, ``QuiescentModel`` and ``QuiescentModelUsingStart``) basados en las ecuaciones de Lotka-Volterra. ¿Habeis notado algo que todos ellos tienen en común? ¡Si los mirais atentamente, vereis que tienen casi **todo** en común y que realmente no hay apenas ninguna **diferencia** entre ellos!

source: In software engineering, there is a saying that "Redundancy is the root of all evil". Well the situation is no different here (in no small part because Modelica code really is software). The code we have written so far would be very annoying to maintain. This is because any bugs we found would have to be fixed in each model. Furthermore, any improvements we made would also have to be applied to each model. So far, we are only dealing with a relatively small number of models. But this kind of "copy and paste" approach to model development will result in a significant proliferation of models with only slight differences between them.
es: En la ingeniería de software, existe el dicho de que "La redundancia es la raiz de todos los demonios". Pues bien, la situación no es diferente aquí (de ninguna manera ya que el código Modelica es realmente software). El código que hemos escrito hasta ahora sería muy engorroso de mantener. Esto es debido a que cualquier error que encontrásemos tendríamos que corregirlo en cada uno de los modelos. Hasta ahora, solamente estamos manejando un número relativamente pequeño de modelos. Pero para el desarrollo de modelos, este enfoque de "corta y pega" resultará en una proliferación importante de modelos que solamente tendrán pequeñas diferencias entre ellos.

source: So what can be done about this? In object-oriented programming languages there are basically two mechanisms that exist to reduce the amount of redundant code. They are *composition* (which we will address in the future chapter on :ref:`components`) and *inheritance* which we will briefly introduce here.
es: Y respecto a esto, ¿qué se puede hacer? En los lenguajes de programación orientados a objetos básicamente existen dos mecanismos para reducir la cantidad de código redundante. Estos son la *composición* (que trataremos en el futuro capítulo sobre :ref:`components`) y la *herencia* que introduciremos aquí brevemente.

source: If we look closely at the ``QuiescentModelUsingStart`` example, we see that there are almost no differences between it and our original ``ClassicModel`` version. In fact, the only real differences are shown here:
es: Si miramos atentamente al ejemplo ``QuiescentModelUsingStart``, vemos que no hay apenas diferencias entre este modelo y nuestra versión original ``ClassicModel``. De hecho, las únicas diferencias reales se muestran aquí:

source: In other words, the only real difference is the addition of the ``initial equation`` section (the original ``ClassicModel`` already contained non-zero ``start`` values for our two variables, ``x`` and ``y``). Ideally, we could avoid having any redundant code by simply defining a model in terms of the differences between it and another model. As it turns out, this is exactly what the ``extends`` keyword allows us to do. Consider the following alternative to the ``QuiescentModelUsingStart`` model:
es: En otras palabras, la única diferencia real es la suma de la sección `initial equation`` (el modelo original ``ClassicModel`` ya contenía valores del atributo ``start`` distintos de cero para nuestras dos variables, ``x`` and ``y``). Idealmente, podemos evitar tener código redundante simplemente definiendo un modelo como las diferencias entre éste y otro modelo. Como se deduce, esto es exactamente lo que nos permite hacer la palabra clave ``extends``. Consideremos la siguiente alternativa al modelo ``QuiescentModelUsingStart``:

source: Note the presence of the ``extends`` keyword. Conceptually, this "extends clause" simply asks the compiler to insert the contents of another model (``ClassicModel`` in this case) into the model being defined. In this way, we copy (or "inherit") everything from ``ClassicModel`` without having to repeat its contents. As a result, the ``QuiescentModelWithInheritance`` is the same as the ``ClassicModel`` with an additional set of initial equations inserted.
es: Nótese la presencia de la palabra clave ``extends``. Conceptualmente, esta "sentencia extends" simplemente le pide al compilador que inserte el contenido de otro modelo (``ClassicModel`` en este caso) en el modelo que se está definiendo. De esta manera, copiamos (o "heredamos") todo del modelo ``ClassicModel`` sin tener que repetir sus contenidos. Como resultado, el modelo ``QuiescentModelWithInheritance`` es el mismo que ``ClassicModel`` con un conjunto adicional de ecuaciones inicialesinsertado.

source: But what about a case where we don't want **exactly** what is in the model we are inheriting from? For example, what if we wanted to change the values of the ``gamma`` and ``delta`` parameters?
es: Pero ¿qué hay del caso en el que no queremos **exactamente** lo que hay en el modelo del que estamos heredando? Por ejemplo, ¿qué pasa si queremos cambiar los valores de los parámetros ``gamma`` y``delta``?

source: Modelica handles this by allowing us to include a set of "modifications" when we use ``extends``. These modifications come after the name of the model being inherited from as shown below:
es: Modelica trata esto permitíendonos incluid un conjunto de "modificaciones" cuando usamos la palabra clave ``extends``. Estas modificaciones vienen despues del nombre del modelo del que se hereda tal como se muestra a continuación:

source: Also note that we could have inherited from ``ClassicModel``, but then we would have had to repeat the initial equations in order to have quiescent initial conditions. But by instead inheriting from ``QuiescentModelWithModifications``, we reuse the content from **two** different models and avoid repeating ourselves even once.
es: Notar también que podríamos haver heredado de ``ClassicModel``, pero entonces tendríamos que haver repetido las ecuaciones iniciales para tener condiciones iniciales inactivas. Pero en lugar de heredar de ``QuiescentModelWithModifications``, reutilizamos el contenido de **dos** modelos diferentes y evitamos repetirnos a nosotros mismos ni una sola vez.

source: More population dynamics
es: Más dinámica de poblaciones

source: This concludes the set of examples for this chapter. If you'd like to explore the Lotka-Volterra equations in greater depth, an upcoming section titled :ref:`population-components` demonstrates how to build complex models of population dynamics using graphical components that are dropped onto a schematic and connected together.
es: Aquí termina el conjunto de ejemplos para este capítulo. Si quereis explorar las ecuaciones de Lotka-Volterra en más profundidad, una sección posterior titulada :ref:`population-components` demuestra cómo construir modelos complejos de dinámica de poblaciones usando componentes gráficos que se introducen en un esquema y se conectan entre si.

source: start attribute
es: atributo start

source: composition
es: composición

source: inheritance
es: herencia

source: extends
es: extiende

source: modifications
es: modificaciones
