Repository: Claire-Eleutheriane/educational_book
Catalog: ModelicaBook/text/locale/*/LC_MESSAGES/behavior/equations/population.po
Languages: es

source: Lotka-Volterra Systems
es: Sistemas Lokta-Volterra

source: So far, we've seen thermal, electrical and mechanical examples. In effect, these have all been engineering examples. However, Modelica is not limited strictly to engineering disciplines. To reinforce this point, this section will present a common ecological system dynamics model based on the relationship between predator and prey species. The equations we will be using are the [Lotka]_-[Volterra]_ equations.
es: Hasta ahora, hemos visto ejemplos térmicos, eléctricos y mecánicos. En efecto, estos han sido todos ejemplos de ingeniería. Sin embardo, Modelica no está limitado estrictamente a las disciplinas de la ingeniería. Para reforzar este punto, esta sección presentará un modelo común de dinámica de sistemas ecológicos basado en la relación entre depredadores y presas. Las ecuaciones que vamos a utilizar son las ecuaciones [Lotka]_-[Volterra]_.

source: Classic Lotka-Volterra
es: Clásico Lotka-Volterra

source: The `classic Lotka-Volterra model <http://en.wikipedia.org/wiki/Lotka-Volterra_equation>`_ involves two species. One species is the "prey" species. In this section, the population of the prey species will be represented by :math:`x`. The other species is the "predator" species whose population will be represented by :math:`y`.
es: El `modelo clásico de Lotka-Volterra <http://en.wikipedia.org/wiki/Lotka-Volterra_equation>`_ implica dos especies. Una especie es la especie "presa". En esta sección, la población de la especie presa estará representada por :math:`x`. La otra especie es la especie "depredadora" cuya población será representada por :math:`y`.

source: There are three important effects in a Lotka-Volterra system. The first is reproduction of the "prey" species. It is assumed that reproduction is proportional to the population. If you are familiar with chemical reactions, this is conceptually the same as the `Law of Mass Action <http://en.wikipedia.org/wiki/Law_of_mass_action>`_ [Guldberg]_. If you aren't familiar with the Law of Mass Action, just consider that the more potential mates are present in the environment, the more likely reproduction is to occur. We can represent this mathematically as:
es: Hay tres efectos importantes en un sistema Lotka-Volterra. El primero es la reproducción de la especie "presa". Se asume que la reproducción es proporcional a la población. Si estais familiarizados con las reacciones químicas, esto es conceptualmente lo mismo que la `Ley de acción de masas <http://en.wikipedia.org/wiki/Law_of_mass_action>`_ [Guldberg]_. Si no estais familiarizados con la Ley de acción de masas, basta con considerar que a mayor numero de parejas presentes en el ambiente, más probable es que ocurra la reproducción. Podemos representar ésto matemáticamente como:

source: where :math:`x` is the prey population, :math:`\dot{x}_r` is the change in prey population *due to reproduction* and :math:`\alpha` is the proportionality constant capturing the likelihood of successful reproduction.
es: donde :math:`x` es la población de presas, :math:`\dot{x}_r` es el cambio en la población de presas *a causa de la reproducción* y and :math:`\alpha` es la constante de proporcionalidad asociada a la probabilidad de éxito de la reproducción.

source: The next effect to consider is starvation of the predator species. If there aren't enough "prey" around to eat, the predator species will die off. When modeling starvation, it is important to consider the effect of competition. We again have a proportionality relationship, but this time it works in reverse because, unlike with prey reproduction, the more predators around the more likely starvation is. This is expressed mathematically in much the same way as reproduction:
es: El siguiente efecto a considerar es el hambre de la especie depredadora. Si no hay suficientes "presas" alrededor para comer, la especie depredadora morirá. Cuando se modela la inanición, es importante considerar el efecto de la competencia. De nuevo tenemos una relación proporcional, pero en este caso funciona a la inversa porque, a diferencia de con la repoducción de las presas, cuantos más depredadores alrededor más probable es la inanición. Esto se expresa matemáticamente en gran parte de la misma manera que la reproducción:

source: where :math:`y` is the predator population, :math:`\dot{y}_s` is the change in predator population *due to starvation* and :math:`\gamma` is the proportionality constant capturing the likelihood of starvation.
es: donde :math:`y` es la población de predadores, :math:`\dot{y}_s` es el cambio en la población predadora *debido a la inanición* y :math:`\gamma` es la constante de proporcionalidad que refleja la probabilidad de inanición.

source: Finally, the last effect we need to consider is "predation", *i.e.*, the consumption of the prey species by the predator species. Without predators, the prey species would (at least mathematically) grow exponentially. So predation is the effect that keeps the prey species population in check. Similarly, without any prey, the predator species would simply die off. So predation is what balances out this effect and keeps the predator population from going to zero. Again, we have a proportionality relationship. But this time, it is actually a bilinear relationship that is, again, conceptually similar to the Law of Mass Action. This relationship is simply capturing, mathematically, the fact that the chance that a predator will find and consume some prey is proportional to both the population of the prey and the predators. Since this particular effect requires both species to be involved, this mathematical relationship has a slightly different structure than reproduction and starvation, *i.e.,*
es: Finalmente, el último efecto que necesitamos tener en cuenta es la "predación", *es decir*, el consumo de presas por las especies predadoras. Sin predadores, las presas crecerían (al menos matemáticamente) exponencialmente. Entonces la predación es el efecto que mantiene la poblacion de presas bajo control. Similarmente, sin ninguna presa, las especies predadoras simplemente morirían. Por eso la predación es lo que equilibra este efecto y evita que la población de predadores caiga a cero. De nuevo tenemos una relación de proporcionalidad. Pero esta vez, es realmente una relación bilineal que es de nuevo conceptualmente similar a la Ley de Acción de Masas. Esta relación simplemente captura, matemáticamente, el hecho de que la posibilidad de que un predador encuentre y consuma alguna presa es proporcional a ambas poblaciones, la de presas y la de predadores. Debido a que este efecto particupar requiere tener en cuenta las dos especies, esta relación matemática tiene una estructura ligeramente diferente que la reproducción y la inanición, *es decir,*

source: where :math:`\dot{x}_p` is the decline in the prey population *due to predation*, :math:`\dot{y}_p` is the increase in the predator population *due to predation*, :math:`\beta` is the proportionality constant representing the likelihood of prey consumption and :math:`\delta` is the proportionality constant representing the likelihood that the predator will have sufficient extra nutrition to support reproduction.
es: donde :math:`\dot{x}_p` es el descenso en la población de presas *debida a la depredación*, :math:`\dot{y}_p` es el incremento de la población de predadores *debido a la depredación*, :math:`\beta` es la constante de proporcionalidad representando la probabilidad del consumo de presas y :math:`\delta` es la constante de proporcionalidad que representa la probabilidad de que los predadores tengan suficiente nutrición extra para soportar la reproducción.

source: Taking the various effects into account, the overall change in each population can be represented by the following two equations:
es: Teniendo en cuenta los diferentes efectos, el cambio global en cada población puede representarse con las siguientes dos ecuaciones:

source: Using the previous relationships, we can expand each of the right hand side terms in these two equations into:
es: Usando las relaciones anteriores, podemos expandir cada uno de los términos de la derecha de las dos ecuaciones en:

source: Using what we've learned in this chapter so far, translating these equations into Modelica should be pretty straightforward:
es: Usando lo que hemos aprendido en este capítulo hasta ahora, traducir estas ecuaciones a Modelica debe ser muy directo:

source: At this point, there is only one thing we haven't discussed yet and that is the presence of the ``start`` attribute on ``x`` and ``y``. As we saw in the ``NewtonCoolingWithUnits`` example in the previous section titled :ref:`getting-physical`, variables have various attributes that we can specify (for a detailed discussion of available attributes, see the upcoming section on :ref:`builtin-types`). We previously discussed the ``unit`` attribute, but this is the first time we are seeing the ``start`` attribute.
es: En este punto, hay una única cosa que no hemos tratado todavía y es la presencia del atributo ``start`` en ``x`` y ``y``. Como vimos en el ejemplo ``NewtonCoolingWithUnits`` en la sección anterior titulada :ref:`getting-physical`, las variables tienen diversos atributos que podemos especificar (para un desarrollo detallado de los atributos de variables, ver la siguiente sección :ref:`builtin-types`). Hemos tratado previamente el atributo ``unit``, pero es la primera vez que vemos el atributo ``start``.

source: The observant reader may have noticed the presence of the ``x0`` and ``y0`` parameter variables and the fact that they represent the initial populations. Based on previous examples, one might have expected these initial conditions to be captured in the model as follows:
es: Un lector observador puede haverse dado cuenta de la presencia de los parámetros ``x0`` e ``y0`` y del hecho de que representan las poblaciones inciales. Basandose en los ejemplos anteriores, uno podría haber esperado que las condiciones iniciales estuvieran capturadas en el modelo de la siguiente manera:

source: However, for the ``ClassicModel`` example we took a small shortcut. As will be discussed shortly in the section on :ref:`initialization`, we can specify initial conditions by specifying the value of the ``start`` attribute directly on the variable.
es: Sin embargo, para el ejemplo ``ClassicModel`` tomamos un pequeño atajo. Como se tratará en breve en la sección sobre :ref:`initialization`, podemos especificar las condiciones iniciales definiendo el valor del atributo ``start`` directamente en la variable.

source: It is worth noting that this approach has both advantages and disadvantages. The advantage is one of flexibility. The ``start`` attribute is actually more of a hint than a binding relationship. If the Modelica compiler identifies a particular variable as a state (*i.e.*, a variable that requires an initial condition) **and** there are insufficient initial conditions already explicitly specified in the model via ``initial equation`` sections then it can substitute the ``start`` attribute as an initial condition for the variable it is associated with. In other words, you can think of the ``start`` attribute as a "fallback initial condition" if an initial condition is needed.
es: Merece la pena mencionar que esta aproximación tiene tanto ventajas como desventajas. La ventaja es la flexibilidad. El atributo ``start`` es realmente más una indicación que una relación vinculante. Si el compilador de Modelica identifica una variable concreta como estado (*es decir*, una variable que requiere una condición inicial) **y** no hay suficientes condiciones iniciales ya especificadas en el modelo a través de la sección ``initial equation`` entonces puede utilizar el atributo ``start`` como una condición inicial para la variable con la que está asociada. En otras palabras, podemos pensar en el atributo ``start`` como una "condition inicial alternativa" si se requiere una condición inicial.

source: There are a couple of disadvantages to the ``start`` attribute that you need to watch out for. First, it is only a hint and tools may completely ignore it. Next, whether it will be ignored is also hard to predict since different tools may make different choices about which variables to treat as states.
es: Hay un par de desventajas del atributo ``start`` con las que tenemos que tener cuidado. Primero, es solamente una indicación y las herramientas pueden ignorar completamente.Después, es dificil predecir si la herramienta lo ignorará ya que las diferentes herramientas pueden hacer diferentes elecciones sobre qué variables tratar como estados.

source: Finally, one additional complication is that the ``start`` attribute is also "overloaded". This means that it is actually used for two different things. If the variable in question is not a state, but is instead an "iteration variable" (*i.e.*, a variable whose solution depends on a non-linear system of equations), then the ``start`` attribute may be used by a Modelica compiler as an initial guess (*i.e.*, the value used for the variable during the initial iteration of the non-linear solver).
es: Finalmente, una complejidad adicional es que el atributo ``start`` es también "sobrecargado". Esto significa que realmente se usa para dos cosas diferentes. Si la variable en cuestión no es un estado, pero es una "variable de iteración" (*es decir*, una variable cuya solución depende de un sistema no lineal de ecuaciones), entonces el atributo ``start`` puede ser usado por un compilador Modelica como un valor inicial estimado (*es decir*, el valor usado para la variable durante la iteración inicial del solucionador no lineal).

source: Whether to specify a ``start`` attribute or not depends on how strictly you want a given initial condition to be enforced. Knowing that is something that takes experience working with the language and is beyond the scope of this chapter. However, it is worth at least pointing out that there are different options along with a basic explanation of the trade-offs.
es: Especificar o no un atributo ``start`` depende en cómo de estrictamente queramos que una determinada condición inicial sea forzada. Conocer esto es algo que requiere experiencia trabajando con el lenguaje y está fuera del alcance de este capitulo. No obstante, merece la pena señalar por lo menos que hay diferentes opciones junto con una explicación básica de sus implicaciones.

source: Using either initialization method, the results for these models will be the same. The typical behavior for the Lotka-Volterra system can be seen in this plot:
es: Usando cualquier método de inicialización, los resultados para estos modelos serán los mismos. El comportamiento típico para el sistema Lotka-Volterra puede verse en este gráfico:

source: Note the cyclical behavior of each population. Initially, there are more predators than can be supported by the existing food supply. Those predators that are present consume whatever prey the can find. Nevertheless, some starvation occurs and the predator population declines. The rate at which predators consume the prey species is so high during this period that the rate at which the prey species reproduces is not sufficient to make up for those lost to predation so the prey population declines as well.
es: Nótese el comportamiento cíclico de cada población. Inicialmente, hay más predadores de los que pueden mantenerse con el suministro de alimento existente. Los predadores que están presentes consumen cualquier presa que puedan encontrar. Sin embargo, aparece algo de inanición y la población predadora desciende. La velocidad a la que los predadores consumen las presas es tan alta durante este periodo que la tasa a la que las presas se reproducen no es suficiente para reponer aquellas perdidas debido a la predación así que la población de presas también desciende.

source: At some point, the predator population gets so low that the rate of reproduction in the prey species is larger than the rate of prey consumption by the predators and the prey species begins to rebound. Because the predator species population takes longer to rebound, the prey species experiences growth that is, for the moment, virtually unchecked by predation. Eventually, the predator population begins to rebound due to the abundance of prey until the system returns to the original predator and prey populations **and the entire cycle then repeats itself** *ad infinitum*.
es: En algún punto, la población de predadores baja tanto que la tasa de reproducción de las presas es mayor que la tasa de consumo de presas por los predadores y las presas comienzan a aumentar. Debido a que a la población de predadores tarda más en recuperarse, la población de presas crece de forma que, por el momento, no se compensa virtualmente por la predación. Finalmente, la población de predadores comienza a rebotar debido a la abundancia de presas hasta que el sistema vuelve a las poblaciones de predadores y presas **y el ciclo completo vuelve a repetirse** *hasta el infinito*.

source: The fact that the system returns again and again to the same initial conditions (ignoring numerical error, of course) is one of the most interesting things about the system. This is even more remarkable given the fact that the Lotka-Volterra system of equations is actually non-linear.
es: El hecho de que el sistema vuelva una y otra vez a las mismas condiciones iniciales (ignorando el error numérico, por supuesto) es una de las cosas más interesantes del sistema. Este hecho es más reseñable todavía teniendo en cuenta el hecho de que el sistema de ecuaciones Lotka-Volterra es realmente no lineal.

source: Steady State Initialization
es: Inicialización en estado estacionario

source: Let's imagine that these extreme swings in species population had some undesirable ecological consequences. In such a case, it would be useful to understand what might reduce or even eliminate these fluctuations. A simple approach would be to keep the populations in a state of equilibrium. But how can we use these models to help use determine such a "quiescent" state?
es: Imaginemos que estas oscilaciones extremas en la población de las especies tuviera algunas consecuencias ecológicas. En ese caso, sería útil entender lo que podría reducir o incluso eliminar esas fluctuaciones. Un enfoque simple sería mantener las poblaciones en un estado de equilibrio. Pero ¿cómo podemos usar esos modelos para ayudar a determinar este estado "inactivo"?

source: The answer lies in the initial conditions. Instead of specifying an initial population for both the predator and prey species, we might instead chose to initialize the system with some other equations that somehow capture the fact that the system is in equilibrium (you may remember this trick from the ``FirstOrderSteady`` model :ref:`discussed previously <ex_SimpleExample_FirstOrderSteady>`). Fortunately, Modelica's approach to initialization is rich enough to allow us to specify this (and many other) useful types of initial conditions.
es: La respuesta está en las condiciones iniciales. En lugar de especificar una población inicial para ambas especies, predadores y presas, podemos escoger inicializar el sistema con otras ecuaciones que de alguna manera capturen el hecho de que el sistema esté en equilibrio (recordareis este truco delmodelo ``FirstOrderSteady`` :ref:` tratado previamente <ex_SimpleExample_FirstOrderSteady>`). Afortunadamente, la aproximación de Modelica para la inicialización es suficientemente rica para permitirnos especificar este (y muchos otros) tipos útiles de condiciones iniciales.

source: To ensure that our system starts in equilibrium, we simply need to define what equilibrium is. Mathematically speaking, the system is in equilibrium if the following two conditions are met:
es: Para asegurarse de que nuestro sistema comienza en equilibrio, simplemente necesitamos definir qué consideramos equilibrio. Matemáticamente hablando, el sistema está en equilibrio si se cumplen las siguientes dos condiciones:

source: To capture this in our Modelica model, all we need to do is use these equations in our ``initial equation`` section, like this:
es: Para capturar esto en nuestro modelo de Modelica, todo lo que necesitamos hacer es usar estas ecuaciones en nuestra sección ``initial equation`` de esta manera:

source: The main difference between this and our previous model is the presence of the highlighted initial equations. Looking at this model, you might wonder exactly what those initial equations mean. After all, what we need to solve for are ``x`` and ``y``. But those variables don't even appear in our initial equations. So how are they solved for?
es: La diferencia principal entre éste y nuestro modelo anterior es la presencia de las ecuaciones iniciales destacadas. Mirando a este modelo, os preguntareis exactamente qué significan estas ecuaciones iniciales. Despues de todo, lo que necesitamos resolver son ``x`` e ``y``. Pero estas variables ni siquiera aparecen en nuestras ecuaciones iniciales. ¿Entonces cómo se resuelven?

source: The answer lies in understanding that the functions :math:`x(t)` and :math:`y(t)` are solved for by integrating the differential equations starting from some initial equations. During the simulation, we see that :math:`x` and :math:`\dot{x}` are "coupled" by the following equations:
es: La respuesta reside en entender que las funciones :math:`x(t)` y :math:`y(t)` se resuelven integrando las ecuaciones diferenciales comenzando por algunas condiciones iniciales. Durante la simulación, vemos que :math:`x` y :math:`\dot{x}` están "acopladas" por las siguientes ecuaciones:

source: (and, of course, a similar relationship exists between :math:`y` and :math:`\dot{y}`)
es: (y, por supuesto, existe una relación similar entre :math:`y` y :math:`\dot{y}`)

source: **However**, during initialization of the system (*i.e.*, when solving for the initial conditions) this relationship doesn't hold. So there is no "coupling" between :math:`x` and :math:`\dot{x}` in that case (nor for :math:`y`: and :math:`\dot{y}`). In other words, knowing :math:`x` or :math:`y` doesn't give you any clue as to how to compute :math:`\dot{x}` or :math:`\dot{y}`. The net result is that for the initialization problem we can think of :math:`x`, :math:`y`, :math:`\dot{x}` and :math:`\dot{y}` as four independent variables.
es: Sin embargo, durante la inicialización del sistema (*es decir*, cuando resolvemos las condiciones iniciales) esta relación no se mantiene. Entonces no hay "acoplamiento" entre :math:`x` y :math:`\dot{x}` en este caso (tampoco para :math:`y`: y :math:`\dot{y}`). En otras palabras, conocer :math:`x` o :math:`y` no da ninguna pista de cómo calcular :math:`\dot{x}` o :math:`\dot{y}`. El resultado neto es que para el problema de inicialización podemos pensar en :math:`x`, :math:`y`, :math:`\dot{x}` y :math:`\dot{y}` como cuatro variables independientes.

source: Said another way, while simulating, we solve for :math:`x` by integrating :math:`\dot{x}`. So that integral equation is the equation used to solve for :math:`x`. But during initialization, we cannot use that equation so we need an additional equation (for each integration that we would otherwise perform during simulation).
es: Dicho de otra manera, durante la simulación, resolvemos :math:`x` integrando :math:`\dot{x}`. De manera que la ecuación integral es la ecuación usada para resolver :math:`x`. Pero durante la inicialización, no podemos usar esa ecuación por lo que necesitamos una ecuación adicional (para cada integración que realicemos durante la simulación.
