Repository: Claire-Eleutheriane/educational_book
Catalog: ModelicaBook/text/locale/*/LC_MESSAGES/behavior/equations/variables.po
Languages: es

source: As we saw in the previous section, a model definition typically contains variable declarations. The basic syntax for a variable declaration is simply the "type" of the variable (which will be discussed shortly in the section on :ref:`builtin-types`) followed by the name of the variable, *e.g.*,
es: Como hemos visto en la sección anterior, la definición de un modelo contiene típicamente declaraciones de variables. La sintaxis básica para una declaración de variable es simplemente el "tipo" de la variable (que se tratará dentro de poco en la sección :ref:`builtin-types`) seguida del nombre de la variable, *p.ej.*,

source: Variables sharing the same type can be grouped together using the following syntax:
es: Las variables que comparten el mismo tipo pueden ser agrupadas juntas usando la siguiente sintaxis:

source: A declaration can also be followed by a description, e.g.:
es: Una declaración también puede continuar con una descripción, p.ej.:

source: Variability
es: Variabilidad

source: Parameters
es: Parametros

source: By default, variables declared inside a model are assumed to be continuous variables (variables whose solution is generally smooth, but which may also include discontinuities). However, as we first saw in the section titled :ref:`getting-physical`, it is also possible to add the ``parameter`` qualifier in front of a variable declaration and to indicate that the variable is known *a priori*. You can think of a parameter as "input data" to the model that is constant with respect to time.
es: Por defecto las variables declaradas en un modelo se asumen como variables continuas (variables cuya solución es generalmente diferenciable, pero que también puede contener discontinuidades). No obstante, como vimos primero en la sección titulada :ref:`getting-physical`, también es posible añadir el calificador ``parameter`` delante de la declaración de una variable y indicar que la variable es conocidad *de antemano*. Podeis pensar en un parámetro como un "dato de entrada" al modelo que es constante respecto al tiempo.

source: Constants
es: Constantes

source: Closely related to the ``parameter`` qualifier is the ``constant`` qualifier. When placed in front of a variable declaration, the ``constant`` qualifier also implies that the value of the variable is known *a priori* and is constant with respect to time. The distinction between the two lies in the fact that a ``parameter`` value can be changed from one simulation to the next whereas the value of a ``constant`` cannot be changed once the model is compiled. The use of ``constant`` by a model developer ensures that end users are not given the option to make changes to the ``constant``. A ``constant`` is frequently used to represent physical quantities like :math:`\pi` or the Earth's gravitational acceleration, which can be assumed constant for most engineering simulations.
es: El calificador ``constant`` esta estrechamente relacionado con el calificador ``parameter``. Cuando se coloca delante de la declaración de una variable, el calificador ``constant`` implica también que el valor de la variable es conocido *de antemano* y es constante en el tiempo. La diferencia entre ambos estriba en el hecho de que el valor de un ``parameter`` puede ser cambiado de una simulación a otra mientras el valor de una ``constant`` no puede ser cambiado una vez que el modelo es compilado. El uso de ``constant`` por parte de un desarrollador de modelos asegura que el usuario final no tiene la opción de hacer cambios en la variable ``constant``. Las ``constant`` se utilizan frecuentemente para representar valores físicos como :math:`\pi` o la aceleración gravitacional de la Tierra, que puede ser asumida constante en la mayoría de las simulaciones en ingeniería.

source: Discrete Variables
es: Variables discretas

source: Another qualifier that can be placed in front of a variable declaration is the ``discrete`` qualifier. We have not yet shown any example where the ``discrete`` qualifier would be relevant. However, it is included now for completeness since it is the last remaining variability qualifier.
es: Otro calificador que puede colocarse delante de la declaración de una variable es el calificador ``discrete``. No hemos mostrado todavía ningún ejemplo en el que el calificador ``discrete`` sea relevante. No obstante, se incluye ahora para ser exhaustivos ya que es el calificador de variabilidad restante.

source: Built-In Types
es: Tipos predefinidos

source: Many of the examples so far referenced the ``Real`` type when declaring variables. As the name suggests, ``Real`` is used to represent real valued variables (which will generally be translated into floating point representations by a Modelica compiler). However, ``Real`` is just one of the four built-in types in Modelica.
es: Muchos de los ejemplos hasta ahora referencian el tipo ``Real`` cuando se declaran variables. Como sugiere el nombre, ``Real`` se usa para representar variables con valores reales (que serán traducidas generalmente como representaciones con punto flotante por un compilador de Modelica). No obstante, ``Real`` es solamente uno de los cuatro tipos predefinidos en Modelica.

source: Another of the built-in types is the ``Integer`` type. This type is used to represent integer values. ``Integer`` variables have many uses including representing the size of arrays (this use case will be discussed shortly in an upcoming section on :ref:`vectors-and-arrays`).
es: Otro de los tipos predefinidos es el tipo ``Integer``. Este tipo se usa para representar valores enteros. Las variables ``Integer`` tienen muchos usos incluyendo representar el tamaño de los arrays (este caso de uso se discutirá en breve en la sección :ref:`vectors-and-arrays`).

source: The remaining built-in types are ``Boolean`` (used to represent values that can be either ``true`` or ``false``) and ``String`` (used for representing character strings).
es: Los tipos predefinidos restantes son ``Boolean`` (que se utiliza para representar valores que pueden ser o ``true`` o ``false``) y ``String`` (usado para representar cadenas de caracteres).

source: Each of the built-in types restricts the possible values that a variable can have. Obviously, an ``Integer`` variable cannot have the value ``2.5``, a ``Boolean`` or ``String`` cannot be ``7`` and a ``Real`` variable cannot have the value ``"Hello"``.
es: Cada uno de los tipos predefinidos restringen los posibles valores que una variable puede tener. Obviamente, una variable ``Integer`` no puede tener el valor ``2.5``, una ``Boolean`` o ``String`` no puede ser ``7`` y una variable ``Real`` no puede tener en valor ``"Hello"``.

source: Derived Types
es: Tipos derivados

source: As we saw in the previous examples that introduced :ref:`physical-types`, it is possible to "specialize" the built-in types. This feature is used mainly to modify the values associated with :ref:`attributes` like ``unit``. The general syntax for creating derived types is:
es: Como hemos visto en los ejemplos anteriores que introdujeron los tipos físicos :ref:`physical-types`, es posible "especializar" los tipos predefinidos. Esta característica se usa principalmente para modificar los valores asociados con los atributos :ref:`attributes` como ``unit``. La sintaxis general para crear tipos derivados es:

source: Frequently, the ``BaseTypeName`` will be one of the built-in types (*e.g.*, ``Real``). But it can also be another derived type. This means that multiple levels of specialization can be supported, *e.g.*,
es: Frecuentemente, el ``BaseTypeName`` será uno de los tipos predefinidos (*p.ej.*, ``Real``). Pero también puede ser otro tipo derivado. Esto significa que se soportan múltiples niveles de especialización, *p.ej.*,

source: Enumerations
es: Enumeraciones

source: An ``enumeration`` type is very similar to the ``Integer`` type. An ``enumeration`` is typically used to define a type that can take on only a limited set of specific values. In fact, enumerations are not strictly necessary in the language. Their values can always be represented by integers. However, the ``enumeration`` type is safer and more readable than an ``Integer``.
es: Un tipo ``enumeration`` es muy similar al tipo ``Integer``. Una ``enumeration`` se utiliza típicamente para definir un tipo que puede tomar únicamente un conjunto limitado de valores específicos. Sus valores pueden ser representados siempre por enteros. Sin embargo, el tipo ``enumeration`` es más seguro y legible que un ``Integer``.

source: There are two built-in enumeration types. The first of these is ``AssertionLevel`` and it is defined as follows:
es: Hay dos tipos de enumeración predefinidos. El primero de ellos es ``AssertionLevel`` que se define como sigue:

source: The significance of these values will be discussed in a forthcoming section on :ref:`assertions`.
es: El significado de estos valores será tratado en la sección posterior :ref:`assertions`.

source: The other built-in enumeration is ``StateSelect`` and it is defined as follows:
es: La otra enumeración predefinida es ``StateSelect`` y se define como sigue:

source: Attributes
es: Atributos

source: So far in this chapter we have mentioned attributes (*e.g.*, ``unit``), but we haven't discussed them in detail. For example, *which* attributes are present on a given variable? This depends on the type of the variable (and which built-in and derived types it is based on). The following table introduces all the possible attributes indicating their types (*i.e.*, what type of value can be given for that attribute), which types they can be associated with and finally a brief description of the attribute:
es: A lo largo de este capítulo hemos mencionado atributos (*p.ej.*, ``unit``), pero no los hemos tratado en detalle. Por ejemplo, ¿*qué* atributos están presentes en una determinada variable? Esto depende del tipo de variable (y de en qué tipos predefinidos y derivados está basada). La siguiente tabla introduce todos los posibles atributos indicando sus tipos (*es decir*, qué tipo de valor puede darse a cada atributo), a qué tipos pueden ser asociados y finalmente una breve descripción del atributo:

source: Attributes of ``Real``
es: Atributos de ``Real``

source: A textual description of what the variable represents
es: Una descripción textual de qué representa la variable

source: The ``start`` attribute has many uses. The main purpose of the ``start`` attribute (as discussed extensively in the section on :ref:`initialization`) is to provide "fallback" initial conditions for state variables (see ``fixed`` attribute for more details).
es: El atributo ``start`` tiene múltiples usos. El propósito principal del atributo ``start`` (como se ha discutido extensamente en la sección :ref:`initialization`) es proporcionar

source: The ``start`` attribute may also be used as an initial guess if the variable has been chosen as an iteration variable.
es: El atributo ``start``puede usarse como estimación inicial si la variable se ha escogido como variable de iteración.

source: Finally, if a ``parameter`` doesn't have an explicit value specified, the value of the ``start`` attribute will be used as the default value for the ``parameter``.
es: Finalmente, si un ``parametro`` no tiene un valor explícitamente especificado, el valor del atributo ``start`` se utilizará como valor por defecto para el ``parameter``.

source: The ``fixed`` attribute changes the way the ``start`` attribute is used when the ``start`` attribute is used as an initial condition. Normally, the ``start`` attribute is considered a "fallback" initial condition and only used if there are insufficient initial conditions explicitly specified in the ``initial equation`` sections. However, if the ``fixed`` attribute is set to ``true``, then the ``start`` attribute is treated as if it was used as an explicit ``initial equation`` (*i.e.,* it is no longer used as a fallback, but instead treated as a strict initial condition).
es: El atributo ``fixed`` cambia la manera en la que el atributo ``start`` cuando el atributo ``start`` se utiliza como condición inicial. Normalmente, el atributo ``start`` se considera una condición inicial "de reserva" que solo se usa si no hay condiciones iniciales suficientes especificadas explicitamente en las secciones ``initial equation``. Sin embargo, si el atributo ``fixed`` se define como ``true``, entonces el atributo ``start`` se trata como si fuera una ``ecuación inicial`` explicita (*es decir*, no se usa más como reserva, se trata como una condición inicial estricta).

source: Another, more obscure, use of the ``fixed`` attribute is for "computed parameters". In rare cases where a ``parameter`` cannot be initialized explicitly, it is possible to provide a general equation for the parameter in an ``initial equation`` section. But in cases where the ``parameter`` is initialized in this way, the ``fixed`` attribute for the parameter variable must be set to ``false``.
es: Otro uso, más oscuro, del atributo ``fixed`` es para los "parámetros calculados". En los raros casos en los que un ``parametro`` no se puede inicializar explicitamente, es posible proporcionar una ecuación general para el parámetro en una sección ``initial equation``. Pero en los casos donde el ``parametro`` se inicializa de esta manera, el atributo ``fixed`` del parámetro debe ponerse a ``false``.

source: **Default**: ``false`` (except for ``parameter`` variables, where it is ``true`` by default)
es: **Por defecto**: ``false`` (excepto para las variables tipo ``parameter``, donde es ``true`` por defecto)

source: The ``min`` attribute is used to specify the minimum allowed value for a variable. This attribute can be used by editors and compilers in various ways to inform users or developers about potentially invalid input data or solutions.
es: El atributo ``min`` se utiliza para especificar el valor mínimo permitido para una variable. Este atributo puede ser usado por los editores y los compiladores de diferentes maneras para informar a los usuarios o desarrolladores sobre soluciones o datos de entrada potencialmente no válidos.

source: **Default**: -:math:`\infty`
es: **Por defecto**: -:math:`\infty`

source: The ``max`` attribute is used to specify the maximum allowed value for a variable. This attribute can be used by editors and compilers in various ways to inform users or developers about potentially invalid input data or solutions.
es: El atributo ``max`` se utiliza para especificar el valor máximo permitido para una variable. Este atributo puede ser usado por los editores y compiladores de diferentes maneras para informar a los usuarios o desarrolladores sobre soluciones o datos de entrada potencialmente no válidos.

source: **Default**: :math:`\infty`
es: **Por defecto**: :math:`\infty`

source: As discussed extensively in this chapter, variables can have physical units associated with them. There are rules about how these units are expressed, but the net result is that by using the ``unit`` attribute it is possible check models to make sure that equations are physically consistent. A value of ``"1"`` indicates the value has no physical units. On the other hand, a value of ``""`` (the default value if no value is given) indicates that the physical units are simply unspecified. The difference between ``"1"`` and ``""`` is that the former is an explicit statement that the quantity is dimensionless (has not units) while the latter indicates that the quantity may have physical units but they are left unspecified.
es: Como se ha tratado de forma extensiva en este capítulo, las variables pueden tener unidades físicas asociadas. Hay reglas sobre cómo se expresan estas unidades, pero el resultado neto es que usando el atributo ``unit`` es posible verificar los modelos para estar seguro de que las ecuaciones son físicamente consistentes. Un valor de ``"1"`` indica que la variable no tiene unidades físicas. Por otra parte, un valor de ``""`` (el valor por defecto si no se da ningún valor) indica que las unidades físicas están simplemente sin especificar. La diferencia entre ``"1"`` y ``""`` es que la primera es una afirmación explícita de que la cantidad es adimensional (no tiene unidades) mientras que la segunda indica que la cantidad puede tener unidades físicas pero se han dejado sin especificar.

source: **Default**: ``""`` (*i.e.,* no physical units specified)
es: **Por defecto**: ``""`` (*es decir,* no hay unidades físicas especificadas)

source: While the ``unit`` attribute describes what physical units should be associated with the value of a variable, the ``displayUnit`` expresses a preference for what units should be used when displaying the value of a variable. For example, the SI unit for pressure is *Pascals*. However, standard atmospheric pressure is 101,325 *Pascals*. When entering, displaying or plotting pressures it may be more convenient to use *bars*.
es: Mientras el atributo ``unit`` describe qué unidades físicas deben estar asociadas con el valor de una variable, el atributo ``displayUnit`` expresa una preferencia sobre qué unidades deben usarse cuando se muestra el valor de una variable. Por ejemplo, la unidad del sistema internacional para la presión es el *Pascal*. Sin embargo, la presión atmosférica estándar es de 101.325 *Pascales*. Cuando se introducen, muestran o grafican presiones puede ser más conveniente usar *bares*.

source: The ``displayUnit`` attribute doesn't affect the value of a variable or the equations used to simulate a model. It only affects the *rendering* of those values by potentially transforming them into more convenient units for display.
es: El atributo ``displayUnit`` no afecta el valor de la variable o de las ecuaciones usadas para simular un modelo. Solamente afecta la *representación* de estos valores transformandolos potencialmente en unidades más convenientes para la visualización.

source: The ``nominal`` attribute is used to specify a nominal value for a variable. This nominal value is generally used in numerical calculations to perform various types of scaling used to avoid round-off or truncation error.
es: El atributo ``nominal`` se usa para especificar un valor nominal para una variable. Este valor nominal se usa generalmente en los cálculos numéricos para realizar varios tipos de escalado usados para evitar errores de truncamiento o redondeo.

source: The ``stateSelect`` attribute is used as a hint to Modelica compilers about whether a given variable should be chosen as a state (in cases where there is a choice to be made). As discussed previously in the section on :ref:`enumerations`, the possible values for this attribute are ``never``, ``avoid``, ``default``, ``prefer`` and ``always``.
es: El atributo ``stateSelect`` se usa como indicación para los compiladores de Modelica sobre si una variable dada debe ser escogida como un estado (en los casos donde hay que hacer alguna selección). Como se ha tratado previamente en la sección :ref:`enumerations`, los valores posibles para este atributo son ``never``, ``avoid``, ``default``, ``prefer`` y ``always``.

source: **Default**: ``default``
es: **Por defecto**: ``default``

source: **Type**: ``StateSelect`` (enumeration, see :ref:`enumerations`)
es: **Tipo**: ``StateSelect`` (enumeración, ver :ref:`enumerations`)

source: Attributes of ``Integer``
es: Atributos de ``Integer``

source: It is worth noting that an ``Integer`` variable can be chosen as a state variable or as an iteration variable. Under these circumstances, the ``start`` attribute may be used by a compiler in the same was as it is for ``Real`` variables (*see previous discussion of* :ref:`fixed-attribute`)
es: Merece la pena notar que una variable ``Integer`` puede ser seleccionada como una variable de estado o como una variable de iteración. Bajo estas circunstancias, el atributo ``start`` puede ser usado por un compilador de la misma manera que para las variables tipo ``Real`` (*ver la discusión previa sobre* :ref:`fixed-attribute`)

source: In the case of a ``parameter``, the ``start`` attribute will (as usual) be used as the default value for the ``parameter``.
es: En el caso de un ``parametro``, el atributo ``start`` será usado (como habitualmente) como valor por defecto para el ``parametro``.

source: **Type**: ``Integer``
es: **Tipo**: ``Integer``

source: *see previous discussion of* :ref:`fixed-attribute`
es: *ver discusión previa sobre* :ref:`fixed-attribute`

source: **Type**: ``Boolean``
es: **Tipo**: ``Boolean``

source: Attributes of ``Boolean``
es: Atributos de ``Boolean``

source: It is worth noting that an ``Boolean`` variable can be chosen as a state variable or as an iteration variable. Under these circumstances, the ``start`` attribute may be used by a compiler in the same was as it is for ``Real`` variables (*see previous discussion of* :ref:`fixed-attribute`)
es: Merece la pena mencionar que una variable ``Boolean`` puede ser seleccionada como una variable de estado o una variable de iteración. Bajo estas circunstancias, el atributo ``start`` puede ser usado por un compilador de la misma manera que para las variables ``Real`` (*ver la discusión previa sobre* :ref:`fixed-attribute`)

source: Attributes of ``String``
es: Atributos de ``String``

source: Technically, a ``String`` could be chosen as a state variable (or even an iteration variable), but in practice this never happens. So for a ``String`` variable the only practical use of the ``start`` attribute is to define the value of a ``parameter`` (that happens to have the type of ``String``) if no explicit value for the parameter is given.
es: Tecnicamente, un ``String`` puede escogerse como variable de estado (o incluso como variable de iteración), pero en la práctica esto no ocurre nunca. Por lo que para una variable ``String`` el único uso práctico del atributo ``start`` es definir el valor de un ``parámetro`` (que resulta ser del tipo ``String``) si no se ha dado un valor explícito para el parámetro.

source: It is worth noting that :ref:`derived-types` retain the attributes of the built-in type that they are ultimately derived from. Also, although the type of, for example, the ``min`` attribute on a ``Real`` variable is listed having the type ``Real`` it should be pointed out explicitly that attributes cannot themselves have attributes. In other words, the ``start`` attribute doesn't have a ``start`` attribute.
es: Merece la pena notar que los :ref:`derived-types` retienen los atributos de los tipos predefinidos de los que derivan originalmente.También, aunque el tipo de, por ejemplo, el atributo ``min`` de una variable ``Real`` se lista como tipo ``Real`` se debe señalar explicitamente que los atributos no pueden tener a su vez atributos. En otras palabras, el atributo ``start`` no tiene atributo ``start``.

source: Modifications
es: Modificaciones

source: So far, we've seen two types of modifications. The first is when we change the value of an attribute, *e.g.,*
es: Hasta ahora, hemos visto dos tipos de modificaciones. La primera es cuando cambiamos el valor de un atributo, *por ejemplo,*
