Repository: Claire-Eleutheriane/educational_book
Catalog: ModelicaBook/text/locale/*/LC_MESSAGES/behavior/equations/variables.po
Languages: es

source: In this case, we are creating a variable ``x`` of type ``Real``. But rather than leaving it "as is", we then apply a modification to ``x``. Specifically, we "reach inside" of ``x`` and change the ``start`` attribute value. In this example, we are only going one level into ``x`` to make our modification. But as we will see in our next example, it is possible to make modifications at arbitrary depths.
es: En este caso, estamos creando la variable ``x`` del tipo ``Real``. Pero en lugar de dejarla "tal como es", aplicamos una modificación a ``x``. Especificamente, dentro de ``x`` cambiamos el valor del atributo ``start``. En este ejemplo, solamente vamos a entrar en el primer nivel de ``x`` para hacer nuestra modificación. Pero como veremos en nuestro siguiente ejemplo, es posible hacer modificaciones a profundidades arbitrarias.

source: The other case where we have seen modifications was in the section on :ref:`avoiding-repetition`. There we saw modification used in conjunction with ``extends`` clauses, *e.g.,*
es: El otro caso en el que hemos visto modificaciones fue en la sección sobre :ref:`avoiding-repetition`. Allí vimos modificaciones usadas junto con la clausula ``extends``, *por ejemplo,*

source: Here, the modification is applied to elements that were inherited from the ``QuiescentModelWithInheritance`` model. As with modifications to attributes, the element being modified (a model in this case) is followed by parentheses and inside those parentheses we specify the modifications we wish to make.
es: Aquí la modificación se aplica a elementos que fueron heredados del modelo ``QuiescentModelWithInheritance``. Como las modificaciones en los atributos, el elemento que se modifica (un modelo en este caso) va seguido de paréntesis y dentro de estos paréntesis especificamos las modificaciones que queremos hacer.

source: It is worth noting that modifications can be nested arbitrarily deep. For example, imagine we wanted to modify the ``start`` attribute for the variable ``x`` inherited from the ``QuiescentModelWithInheritance`` model. In Modelica, such a modification would be made as follows:
es: Merece la pena notar que las modificaciones pueden estar anidadas en profundidades arbitrariamente. Por ejemplo, imaginemos que queremos modificar el atributo ``start`` de la variable ``x`` heredada del modelo ``QuiescentModelWithInheritance``. En Modelica, esta modificación se haría de la siguiente manera:

source: Here we first "reach inside" the ``QuiescentModelWithInheritance`` model to modify the contents that we "inherit" from it (``x`` in this case) and then we "reach inside" ``x`` to modify the value of the ``start`` attribute.
es: Aquí primero "entramos dentro" del modelo ``QuiescentModelWithInheritance`` para modificar el contenido que hemos "heredado" de él (``x`` en este caso) y despues "accedemos al interior" de ``x`` para modificar el valor del atributo ``start``.

source: One of the central themes of Modelica is support for reuse and avoiding the need to "copy and paste" code. Modifications are one of the essential features in Modelica that support reuse. We'll learn about others in future sections.
es: Uno de los temas centrales de Modelica es el soporte a la reutilización evitando la necesidad de "copiar y pegar" código. Las modificaciones son una de las características esenciales en Modelica que soportan la reutilización. Aprenderemos sobre otras en secciones futuras.

source: attributes
es: atributos

source: quantity attribute
es: atributo quantity

source: start attribute
es: atributo start

source: fixed attribute
es: atributo fixed

source: min attribute
es: atributo min

source: max attribute
es: atributo max

source: unit attribute
es: atributo unit

source: displayUnit attribute
es: atributo displayUnit

source: nominal attribute
es: atributo nominal

source: stateSelect attribute
es: atributo stateSelect

source: modifications
es: modificaciones

source: modification
es: modificacion

source: attribute
es: atributo

source: attribute modification
es: modificación de atributos

source: hierarchical
es: jerárquica
